{"podcast_details": {"podcast_title": "Fireside Giants - A New York Giants Podcast", "episode_title": "Giants V Jets Post Game: Standout players, Takeaways", "episode_image": "https://www.omnycontent.com/d/playlist/0bdd4a2d-2e09-4198-8e56-aa4900702eb0/7b6324f5-0012-4f0a-a732-abdf00dae41d/1f6e9614-68e5-4030-b1dd-abdf00dae428/image.jpg?t=1666366247&size=Large", "episode_transcript": " How's it going Giants fans? Welcome back to Fireside Giants. For the post game, really only watch the first two, three quarters because the second half of the third preseason game against the New York Jets. I know most of you guys probably don't care about what happens since most of those guys will not be playing on this team. They'll probably be cut up this upcoming Tuesday when roster cuts are supposed to happen. Obviously you can find all of that here on Fireside Giants. I'll have you covered with all the latest news. But today's game, any big takeaways from the Giants versus Jets game? I mean the main takeaways that I'm so done with preseason football guys, I cannot wait until week one. A couple things that did stand out to me though, guys like Trey Hawkins did not play today, which is a pretty clear indication they're trying to keep the majority of their starters healthy. They're trying to keep their young rookies healthy. Jalen Hyatt did play today, but the fact that Hawkins didn't play says to me that they anticipate him starting on week one against Dallas, which is a really big development for a sixth round rookie to actually make the starting team. And that actually indicates that Adore Jackson will kick into the slot against CD Lam. So you got Michael Gallup, you got some outside guys, Noah Brown, they have Brandon Cooks as well. So you know they got some speed there and the Giants can definitely use that intangibles and tangible traits that Trey Hawkins and Deontay Banks bring to the table that I thought this is surely is going to help them lock down some of the fastest receivers in this game. But today Giants first, Jets will take a look at some of the statistics. Obviously you know the quarterback battle behind Daniel Jones. Tommy DeVito looked pretty good. I mean at half time he was 13 for 22, 126 yards. Yeah he did have that pick six, but if you watch the clip closer you can see David Sills just completely gave up on the route, should have been more aggressive, attacked the football. Instead he just sat there until the corner back was able to get into position to make a nice play. But DeVito looked pretty good in some occasions. I mean he ran for 20 yards on five carries. Again this is at half time so you know his stats probably will change by then. But he was looking pretty solid. You know he drove down the field right before half and got that field goal to bring the Giants within one point. So you know I do think that Tyrod Taylor is probably still going to end up as the primary backup behind Daniel Jones. But Tommy DeVito is a nice little developmental piece. I mean Tyrod Taylor's contract expires after this year. I mean I guess it's possible the Giants end up just releasing him and going with DeVito at the end of the day. Like if Daniel Jones goes down I mean you're kind of screwed. Like Tyrod Taylor, Tommy DeVito, pick your poison. They're neither of them going to be able to carry this offense. So you may want to go with the guy that's a little bit younger, has a little bit more upside. Someone who showed some spark and some spunk during this preseason. Then the running backs, you know James Robinson had a decent day, had a 28 yard scamper. You know, Chloe Pimpleton ran into David Sills, saw that. I don't know if you guys saw that clip. It was kind of an end around there and he just completely bulldozed David Sills who was the lead blocker. Sills actually ended up with 44 yards at half time, could improve by then. But some decent, you know, receiving options. Lawrence Kaiger, tight end, competing for a roster spot, former jet actually. So he was a wide receiver transition into a tight end. We'll see if he can kind of fight his way onto this roster, still yet to be seen. Jameson Crumber, Crowder had a fumble. In the defensive side, Alex Cook, four tackles, had a solo. Arawarie had two tackles. Had a decent coverage on Garrett Wilson earlier in the game, but they called a defensive pass interference and I feel like there was that early play where Jalen Hyatt got a couple steps on Saas Gardner and he kind of tugged him and it looked like it could have been DPI. I think he hit it pretty well. But that definitely might get called, I guess 50-50 because Arawarie got called on it a couple of plays later when he was covering Garrett Wilson. So definitely inconsistency there from the referees, but you know, we're not prone to that. We've seen that a lot of times in the NFL calling it one way or the other. So I think that for the most part I was happy to see Jalen Hyatt burn Saas downfield. Bad throw by Tyrod Taylor. Daly Jones probably puts it in his lap, but that's not to be, we won't see that until week one. Zion Gilbert went down with an injury. He's probably off this team, not one of my favorite players. There was a lot of injuries in this game. Wyatt Davis had an ankle injury that knocked him out and one of the bigger ones that we were kind of curious about was Bryce Ford Wheaton also picked up a knee injury and he looked good as a gunner. He was making some plays. The Giants wanted to see him in this final game, you know, maybe wreck up some yards and some targets, but unfortunately knocked out early with the knee. Hopefully it's nothing too serious. If it is serious, he probably lands on IR. I mean, he could end up on the practice squad, but definitely doesn't help his chances of making the roster. He was looking pretty good as a gunner. I know the Giants are probably disappointed about that because it makes their jobs a little bit more difficult, but if it's nothing serious, I still think there's a decent chance, like a 70% chance that he does make this roster as an undrafted free agent out of West Virginia. And I have to say the Giants are just getting substantial value out of so many late round draft picks and undrafted guys. I mean, you look at what they just got with Isaiah Simmons. He had a nice pass rush from the left side. He got after Aaron Rodgers, forced it in completion, didn't finish it off, but he was in the backfield almost instantly. He ran right past the running back. So there were some nice plays here that we did see that did stand out for the most part. You know, a guy that's kind of not getting a lot of attention this preseason, but it's been pretty good, Carter Coughlin. He had two tackles and two tackles for a loss. So he was pretty solid. I was happy to see Carter Coughlin making some stops and, you know, making some moments happen for him. You know, he's competing. Obviously, he's been a more of a special teams kind of player over the past couple of years since he was drafted during the Dave Gettelman era, but he's made a nice little impact during preseason. But as I said, you know, those late round draft picks panning out, that's what makes good teams good. Like having, you look at the 49ers, the Brock Purdy's of the world, the Elijah Mitchell's of the world, like those players that you can hit on. That's what helps you invest in other spots later on. That's what helps you invest. I want to trade a first round pick and take a gamble on this player to win a championship because our late round picks are panning out. You know, the cost alternative of, you know, your six round pick and Trey Hawkins. Imagine if he didn't pan out. Imagine if he didn't play well and he didn't even make this team. It's a waste of a pick. And now you have to force a Dory Jackson, your one player away from being in a really bad spot. Trey Hawkins obviously hasn't proven anything yet. But more so, the potential is there. We're seeing the consistency. We're seeing the tangible traits. And that's incredible. Jordan Riley is another guy. You know, defensive tackles showcase some good stuff. He can absorb contact, absorb double teams and really open up opportunities for other players. Definitely another guy I've been going to be keeping my eye on over the next couple of weeks, seeing if he can make an impact one way or another. Darnay Holmes, you know, played a little bit in this game. We'll see if he even makes this team. Obviously the slot cornerback position of Hawkins and Banks are manning the boundary corners. You're probably not going to see Holmes get money opportunities. He probably will get cut. He takes a $2.7 million cap hit this year. Giants probably will want to move off of that, save the money if not convince him to take a much bigger pay cut like veteran minimum type of cut. Kind of like what Darius Slayton did last year, bet on himself, see if he can leverage that into a better deal. But right now, I think it's kind of looking like slow bucks for Darnay Holmes. Some of these guys are definitely struggling. One guy though, I mentioned him earlier, Alex Cook, undrafted free agent. He looked really good today. He had some nice pursuit on some running plays. He had some tackles. He made some plays. I mean, these guys, there's some of these players that are just looking better. So it is, it is encouraging. It's going to be tough to iron out this roster at the back end. The injuries, as I mentioned, you know, Chris Myrick, he went down with a hand injury. There's a whole bunch of them. So now the and Kahlil Pimpleton too with an arm or a hand injury as well. So the Giants, you know, are going to have to navigate that consider those injuries. And if they're serious, they're gonna have to move off and really inopportune time for those guys. But against the first string, just defense, just offense, rather, they went out there and kicked him off the field and the first drive, Rogers comes back, obviously threads the needle to Garrett Wilson or unbelievable throw showcases that veteran savvy. And he looks just phenomenal that second drive. So you know, it's Aaron Rodgers at the end of the day, he is a stud. He's a superstar. And, you know, your second defense can get him off the field one time out of two, you're probably smiling and happy about that. But the Giants quickly moved over Zion Gilbert gets knocked out. You're seeing guys like Darren Evans on the field on drafted guys like Jamon Green. So you know, there's a lot of backups fighting for spots here, you're gonna see a lot of them end up on the practice squad. But J. Sean Corbin's had a pretty good spring, rather summer and you know, Eric Gray had a couple of decent runs. So you know, we'll see if they can fight the way into the roster. But this this performance by James Robinson certainly makes the Giants think a little bit harder. I still think that Eric Gray is gonna be Eric Gray, Saquon and then Matt Breda hasn't even played. So I imagine like they're just they don't they know what Matt Breda is a veteran, he they got a guy with experience there. He's cheap too. So I imagine they probably keep that. But you know, the Giants going into this week one game against Dallas is going to be exciting. There's a lot to be looking forward to. I'm happy they didn't play under their starters. Nobody got hurt. The Giants starters and the majority of their main primary guys are healthy. And that's all we can ask for at this point in time. backup wise, a lot of injuries, Wyatt Davis, Zion Gilbert, Chris Meyer, a Khalil Pimpleton, Bryce Ford, we didn't all went down today. And that was only in the first half. So we'll see what the second half brings. And obviously, you know, most of these guys are probably going to be cut David Sills, you know, that pick six could have done a little bit better there hasn't he had a couple of decent moments, but also a couple of bad moments. They targeted him a lot in seven targets by the half. So we'll see how things progress here. But so far, you know, the injuries don't help the Giants at all. But at least if not any starters, and I'm ready for regular season football, my friends, I'm ready for the Giants to be out there week one against the Dallas Cowboys and MetLife, it's going to be an absolute banger. And we got you guys covered over the next couple days. You know, with cuts coming up, there's gonna be a lot of news dropping. So you don't have to go anywhere else. We got you on fireside Giants as always, my friends, make sure to like and subscribe. We'll catch you guys on the next episode."}, "podcast_summary": "In this episode of Fireside Giants, the host gives a post-game analysis of the New York Giants' preseason game against the New York Jets. The host mentions that although preseason games may not be as important, there were still a few key takeaways. One standout was rookie wide receiver Trey Hawkins, who did not play in the game, indicating that he may be starting in Week 1 against the Dallas Cowboys. This would also mean that Adoree' Jackson would play in the slot against CD Lam. The host also discusses the performances of backup quarterbacks Tommy DeVito and Tyrod Taylor. DeVito had a solid performance, despite a pick-six, and may be a good development piece for the future. The host provides statistics for other players, including running back James Robinson, wide receiver David Sills, tight end Lawrence Kaikar, and defensive players Alex Cook, Carter Coughlin, and Jordan Riley. The host emphasizes the importance of late-round draft picks and undrafted players who have been performing well for the Giants. The host also mentions various injuries that occurred during the game, including those to Zion Gilbert, Wyatt Davis, Bryce Ford-Whiten, Chris Myrick, and Khalil Pimpleton. The host notes that many of these players may be cut from the team. The host concludes by expressing excitement for the regular season and assures listeners that Fireside Giants will continue to provide coverage.", "podcast_guest": {"name": "Trey Hawkins", "org": "New York Giants", "title": "Cornerback", "summary": "Larry Tre Hawkins III (born August 1, 2000) is an American football cornerback for the New York Giants of the National Football League (NFL). He played college football at Trinity Valley and Old Dominion. He was drafted by the Giants in the sixth round of the 2023 NFL Draft."}}
