{"podcast_details": {"podcast_title": "The Mike Francesa Podcast", "episode_title": "Cashman's Mea Culpa & Rodgers' High Expectations", "episode_image": "https://megaphone.imgix.net/podcasts/5d54eee2-19af-11ee-aa5f-8f4f03b719aa/image/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Get a master class in betting from Sir Nigel Sealy. I've said before, hedging is for gardens, me press. Don't be a moron, put more on. Listen to Nigel and Betting Weekly Podcasts, exclusively on the Bet Rivers Network. Download the Betting Weekly Podcasts on Spotify, Apple, or wherever you get your podcasts. It's the Mike Francesa Podcast on the Bet Rivers Network. Hello again everybody and welcome to the Mike Francesa Podcast as we begin or head towards another August weekend. Football right around the corner and we have some very interesting things for you. Coming up this football season, we'll tell you more about it in the days and couple of weeks to come. But we'll install them for the football season. Just make sure you have the Bet Rivers app and use Bet Rivers for all of your wagering needs and you'll be ready to go. You won't miss a second of it, so that's it. Just have the Bet Rivers app and you cover it. Just get that new and improved app, put it up and away you go. So, couple of things here first. Before we get to the sports, if you have followed our racing exploits, I know a lot of you do. You know the saga of High Oak. High Oak was a very, very promising two-year-old who won his first race, won the Saratoga Special in his second race by four and a half lengths. Beat Gunnight, who has become a very good sprinter as a matter of fact. He and Elite Power will tangle in the forego. But not just Elite Power and Gunnight will tangle in the forego Saturday on the Travis card. He has five grade ones, including the Travis, so it's a great day of racing at Saratoga. But High Oak will run in the forego. So, in the grade one at Saratoga where he won the Saratoga Special as a two-year-old, as you probably know, we thought he had a very good chance to be a prominent factor in the Derby. He went down to start his three-year-old campaign in Gulfstream in the Fountain of Youth. He suffered a terrible spill, did a somersault, lucky he didn't break his neck. He didn't race again that year. We gave him the rest of the year off. We tried to bring him back. As we brought him back, he just showed no interest in racing. We didn't know if he was scared, psychologically scarred. We just could not get him to seem like he was involved. He was training well. He looks the part of a champion. He's a gorgeous horse. And then at Saratoga this summer, we put Katie Davis on him. And in his last race, he looked like the old High Oak. He went from last, almost won the race. If there had been two more jumps, he would have run the race. He finished second. And now he's been training superbly. I love Saratoga. And this horse who, we didn't know if he'd ever run again or ever run successfully again. A horse that had been so promising as a two-year-old will now run in the Grade 1 forego on Saturday. It's an incredible story. It really is. With Katie Davis aboard, she's earned the right. We're not going to a superstar jockey. We're giving her the mount. She deserves the mount. She has connected with the horse. She got him to run again. So she will be on him on Saturday in a select field of five against two of the better ones in the country, Gunnight and Elite Power, who's the best sprinter in the country. Or very close to it. And Gunnight, a horse that High Oak beat in the Saratoga Special, Gunnight came back and won the hopeful over and off track a couple weeks later. And it's a wonderful, wonderful colt. But it should be very interesting. It's an amazing story. It's an amazing story with Katie Davis. It's an amazing story of a comeback. So we're very excited about that. We'll see how things go on Saturday. All right. The Yankees didn't go back and touch 19-13 as everyone wondered if they would with the 10th straight loss. Judge obviously got things going last night, got them a lead for the first time in 61 innings with a long home run in the first inning. Got a grand slammer to open the game up and then added a third home run. So a very big night for Judge. We know Judge isn't the issue. We know Judge isn't the problem. But they have a lot of problems. As Cashman alluded to yesterday in probably the artist's public appearance of his career, he had to get up and basically take it on the chin and say, hey, we're awful. We're disappointed. We're all on the line. We all have to look at ourselves. You know, do the whole mea culpa yesterday. As the Yankees had lost nine in a row, now they have a one game winning streak and they don't call themselves out of it. But let's be honest, the Yankees aren't going anywhere. They feel we know that. It'll be interesting to see if they even finish with a winning record. It's going to be touch and go for that, as a matter of fact. But there needs to be wholesale changes. I do not think Cashman, who just signed a new contract last winter, is going to be part of the changes in any way. I don't know if Boone is going to be. I think there's a distinct possibility of change to the manager just to be just to kind of wipe out this year. You know, it's easy to blame the manager, folks, and he is the least of the problems. The manager is always the least of the problems. It's on the configuration of the team and it's on the players. The manager is not usually the issue. Very rarely is he the issue where he's so inept that he has to be replaced or he doesn't connect. Usually it's that basically a couple of the stars have gotten tired of hearing from him. That's basically what happens. So they change it. I think they probably will change the manager just because they want to distance themselves from this season more than anything else. But they need to examine what their plan is. And their plan has to be to get younger. And I'll tell you something, their prospects don't look great. Their youngsters don't. I think Volpe is going to be a good player. I think he's withstood a lot of this season. He's withstood two or three slumps. He's a heads up player. He has not let his defense falter whenever he has been hurting at the plate. He's danced every dance. He's going to finish with good power numbers. He's going to finish with good defensive numbers. And you know what? He's a player. I'm not ready to tell you he's a star, but he's a player. And he's an everyday player. And he's a heads up player. So he's done okay. Not great, but okay. And the Yankees are covered there. The other youngsters, the Yankees always overrate their youngsters. So we'll wait and see. I don't see anything eye catching. I don't see anything special. Let me see more of them and we'll see. The Yankees have to get younger. They need to get rid of some older players. There's no question about that. And whether that is, it's definitely got to be Donaldson. Whether it's Rizzo, whether it's LeMeyu. Stanton's not going anywhere because no one's touching that contract. The bottom line is they need to get younger. They need to bring in some balance in the lineup and get some left handed hitters, both power and on base. And they desperately need a lead off hitter. Their inability to get on base is a huge issue. And they haven't had really good table setters and they need one to put in front of judge. They need two. And bat judge third, that's what I would do. And I'd put two guys in front of them. So that in the first inning or the next time he comes up, if you want to walk him, a lot of times if there's a guy on base, you want to walk him, then you got a couple of guys on base and you still got a chance for the guy to break the game open if they pitch around them. Last night they couldn't pitch around them and you saw what happened. You got a stroke going. You know, he had been in a slump. He had seen some balls die on the track in the last couple of days. And then last night they weren't dying on the track, that's for sure, as he hit three home runs, which is, hey, whenever you hit three home runs, it's a big night. I don't care who you are, it's a big night, even judge. So that was a special night. But it's one game against a bad team. That's all it is. In what is a dreadful, dreadful season. And you saw the first, you know, self-examination of many self-examinations yesterday with Cashman. He said that Hal and he and Boon had met. They would examine everything. Everybody will be under review. They'll all be under review. Cashman's not going anywhere. Like I said, very good chance Boon goes somewhere just because it's very easy to change the manager. Very easy. And it's the least of the problems. And it's the easiest thing to do. And it looks like major change to the fan base. That's why it happens so often when a team has a bad year, because it's the easy, most cosmetic, most obvious thing to do. And it doesn't cost a lot. It doesn't hurt anything. And it's always easy to do. The other stuff is hard to do. It's hard to get rid of players. It's hard to get rid of players with big contracts. It's hard to change the face of your team. That's hard. Getting rid of the manager is easy. Especially when he hasn't won anything. But the Yankees haven't won anything. Since Boon hasn't won anything, the Yankees haven't won anything because they've been badly, badly put together for years. And it has finally come to a head. So hopefully the Yankees acknowledge where they've made their mistakes. And look in the mirror and go back and think about how a Yankee team is supposed to be built. In the ballpark they're playing. And stop overloading this team with right-handed bats, which has been going on for years now. I mean that is so against any part of the Yankee tradition. It's got to stop. Now we're heading towards, with the Mets I don't have much to say. Listen, I've said it to you more than once. I could talk now about Alonzo trade rumors and everything else. There is a campaign going on that is anti-Alonzo. It's not fair. He's getting way too much of the blame. And remember, be careful before you trade a guy who dances every dance and is capable of putting up 45, 120 every single year. Those guys don't come around every day. So if you're going to deal him, you better get a truckload of talent back. Or it will be a big mistake that you will see, visibly see, every single day. Now I know the Met fans especially, even more so than the Yankee fans, because the Yankees have judge, have been dreaming of Atani and this idea that, oh, Cohn's money is going to bring him here. I never thought it would. And now that you have the very good chance that he needs surgery on his arm again, the pitching experiment will probably go by the boards for the foreseeable future and maybe forever. Who knows? So he will become a slugger. Not that he isn't a premier slugger. He shows that he is. But the unique quality that he brought to the sport, the ability to also pitch is over for the foreseeable future. And who knows where this takes him. If he needs Tommy John, we don't know yet. We do know that he has a ligament there. So he has been shut down from that standpoint, obviously, and we will see what that means for him going forward. Did it cost him some money? It has to because it takes away that dual capability that everyone finds so attractive. Has it ever produced victories or produced anything positive for the team? No. But it's a good show. And that's what it's been. Not that he isn't very good at what he does. He is. But I mean, the Angels have had Atani and Chatham. They can't get out of their own way. Baseball is a tricky game. Teams have to have certain qualities to win. And very rarely can it be just about one player because a lot of great players have been on bad teams. Check out how many World Series Ted Williams played. And nobody was better. There was no better hitter. We head towards the giant jet game, which this year, it's always the one pay attention moment of the preseason. You always pay attention to the giant jet game, even if it's just the first half, because usually it's a good dress rehearsal. And then when it was announced that Rogers would play now, nobody has said how long Rogers will play. If the Giants get through and hit him. And hit him hard one time, he's going to be out of the game. I mean, you can you can take that to the bank. So if there's a breakdown on that line one time early in the game, he'll be in there for one or two series. Would he play a quarter? I doubt it. Would he play two series? Probably. Who knows? I don't know what's in his head. I think he wants to get on the field. I think he wanted to fill the ballpark. I think he wanted, which I think he clearly will. I think he wanted to hear the fans and just get, you know, a couple of snaps under his belt. And get ready for the regular season and just feel what it's like. And he will bring a lot to this game because of that. You know, you usually see most of the starters for a good part of the first half in this game and that's it. Or a quarter, whatever, depending on the player. I mean, if a player has a little bit of injuries, not playing. And if he, you know, if he's somebody that you worry about injury wise, then you don't play him. I mean, that's all there is to it. But he's going to see the field. I know people say, oh, he's going to get hurt. Well, we don't know that. You never know that. That's silly. You can get hurt in practice. So, I mean, the bottom line is you don't worry about that. But he's not going, you better be in your seat for the start of the game because I'm sure he's not going to be in there very long. So it is really much ado about very little. But at least you will finally see some live action with him and have a couple of moments with them. And let's be honest, the Jets are loaded in certain spots. You love a lot of their skilled people. Have Aaron Rodgers, a quarterback. You're only worried about that offensive line and you're going to be worried about it right from the get go. From the first moment of day one, when the regular season starts, all season is going to be what we talk about. Because they have got to make sure they can protect him. And listen, he'll get rid of the ball lightning quick on first down, second down, but on third and 10, he's going to need some help. He's going to have to get protection. And game one is going to be a very, very good test for that. And we're just not going to know that, like I said, all season, there's a lot of things to really like about the Jets. And there's two things that worry you, at least worry me, and that is the offensive line and whether or not the coaching staff is up to this. They have to prove that that kind of coaching staff, that they're able to take a team a long way. Because you're asking them to basically take a quantum leap here, not a little leap, a very big leap. From being a losing franchise to being a prominent franchise that can go deep into the playoffs, not just show up in the playoffs, but go into the playoffs with a chance to do something. So that's asking a lot in one season. That's a very, very big leap for a lot of players, and there's a lot of players there. Now, there's some players there that obviously have experience, but there's players that have none. A lot of them, a lot of key ones. Well, Rogers can bring a lot of that forward. He can push a lot of that forward. The question is, can he carry the entire thing forward and overcome some of the things that may have to be overcome on the offensive line in the coaching staff? Remains to be seen, but I tell you, it's going to be a fascinating year. I told you we'd start to do football and do it in depth. I have a lot to say about the Giants, but I'm not going to say it here today. We're going to wait. We have a lot of time still. We've got a couple of weeks until the season starts. I mean, the summer just shoots by so quickly, it's unbelievable. You know it, but August is almost in the books, and then before you know it, it'll be time for a Football Friday. We're looking forward to it. And as I said, we've got a lot of things to tell you about that are going to be new with the folks at Bet Rivers this year and some of the things we're going to do. We're going to tell you all about that in the days and weeks to come. So all that is straight ahead of us. Your emails, what are we listening to? You're listening to the Mike Francesa podcast on the Bet Rivers Network. Send your emails to MikeFrancesapodcast.com. Here we go, Jonathan, as bad as the Mets are now, even though they have played a bit better of late, and as bad as they might be next year, do you still think right now they're in better shape long term than the Yankees are? Do you still think? I don't remember saying that they were in better shape than the Yankees right now. I think the Yankees are in better shape for next year because of the people they have on the contract in terms of the starting pitching and the ballpen. The Yankees have better pitching. If they're healthier. Now the Yankees are number three in the league in games lost to injuries this year. Remember the Dodgers are number one in their over 30 games, over 500. So it can be done. I think it's Dodgers, Angels, Yankees, a one, two, three. I would say for next year. Now long term baseball is not because of the money that both teams have and their ability to sign free agents. You can't look at the team more than one year down the line. I mean, I don't see great prospects in either franchise. As far as youngsters, I don't look at the farm. Neither farm system is rated that highly. I don't see any pitching in the Mets farm system. And the Yankees have better guys on the contract. They have a starting rotation on the contract. The Mets don't. That's what makes them better next year. The problem for the Mets next year is right now. Really, if you're going to tell me they have two guys that you can count on to win next year. Forget when. I think Senga is going to be a good pitcher. I think he's close now. I think he'll learn the ropes. I think he'll be better on the road. I think he'll adjust and be more reliant and more fastball oriented in the future. I think that's big. Quintana, if you want to count on him, his pitch is okay. But okay. Not great. If you're going to tell me he's the back of the rotation, fine. If you can tell me he's the front of the rotation and Senga is the top of the rotation, well, you're in big trouble. If they're three and four, I'm okay. If they're one and two, you're in big trouble. Right now, they're the only two guys you can count on. Now, they have a lot of money so they can buy a couple of guys. But how good a starting rotation are they going to have? They're going to get the yards back, which is big. You can build a bullpen in one year. But they just don't have any starting pitching. And you can't call a team a contender if it doesn't have any starting pitching. John, are you surprised the Yankees never made a play for Schwaber? Hey, I wanted to make a play for Schwaber a thousand times. A thousand times. I wanted him to get Olson, who I picked to win the MVP this year before the year started. He's not going to win it. He's going to finish second because of the year Akuna's had. But he's had a great year. He might wind up leading in baseball and home runs and all the yards. Olson made a ton of sense. Schwaber always made sense. He was perfect for them. But, you know, it never happened. He would have been great with the Yankees. I wanted him. He's a legitimate, legitimate guy who would be a monster in Yankee Stadium. He's a monster anyway. He'd be a monster in Yankee Stadium without any question. What is it that the Mets don't like about Alonso? I really don't understand why there's so much smoke around Alonso. I hope that he's a Met for life. Maybe that's not happening. There's no question there's a campaign going on against Alonso. I'm not saying Alonso didn't change. I'm not saying he didn't have some confrontations. I'm not saying any of that. What I'm saying is it sure isn't his fault every day. And the bottom line is he plays every day and he slugs every day. And you want guys like that around. So I do think there's a bit of a campaign going on and I don't think it's very fair. Doug, any reaction to the debate last night? Yes, I watched the debate last night. I would have liked it if Trump was there, it'd be more entertaining. But let me say this, as far as the debate last night, I thought the best answers were given by Nikki Haley. I think a couple of guys at the podium last night might as well not even show up again. I think Christie's got a long, long hard road to even make a dent. Same thing, I don't think Pence has a chance. I don't think anybody gained a lot of traction last night. But to me, here's what's comical. If you turn on TV after the debate, and I watched the debate, because I like that stuff, if you turn on TV after the debate, tell me where you can go on television and get an objective analysis. Don't even try. If you go to MSNBC, you wouldn't even know there was a debate. If you get them at CNN to mention it, you know it's skewed. And then Fox is so much the other way. The three of them are a joke. Fox, CNN, MSNBC, they're all so biased. One way or the other. The idea, and they all criticize each other for being so biased, and they're all so biased, it is almost disgraceful. It's a joke. You cannot watch any of them for objective news. There is no place to go for objective news anymore. You might as well make your own decisions, because every bit of news you get on cable for get is so rigidly slanted. It is a joke. You know on Fox that everything Biden does is the worst thing that ever happened, and you know on MSNBC that everything Trump has ever done is the worst thing that could ever be done. And you know he should be thrown into jail and throw away the key. So you know that it is so unbelievably biased. It is a joke. It's amazing how poor and how biased the coverage is. I would like to go to a place where somebody would not insult your intelligence and give an objective opinion about anything. Anything. But when you deal with politics, it is impossible to find. Everybody has got an angle, and that is the way it sells, because otherwise it doesn't sell. They only get the viewers that sing their song. So if you are a dyed-in-the-wool Democrat, you're going to watch MSNBC, and if you are a dyed-in-the-wool Republican, and you're a Trump guy, you're going to watch Fox News. That's just the way it is. So that's why I watch CNBC, and worry about the stocks. You know, and just cheer for Nvidia, like always. That's my reaction to the debate. I know preseason means nothing, but it looks like Daniel Jones has a target he really likes, and Waller's going to have a great season. He was an incredible pick-up. He's going to catch 90 balls, and that might be light. He is going to make things much, much more comfortable for Daniel Jones. He is going to be a very, very comfortable target, an available target, a very productive target. And if you can be available and productive, bingo, bingo, bingo. That's it, and that's going to happen. Giants are going to be better. There's no question. They're going to be better on offense. They're going to be better on defense. The problem is that the Giants overachieved last year. They stole games with their coaching and some clutch play that they never, ever had a right winning. Now they're going to face a tougher schedule, and the ball might not go their way as it did last year. I mean, when you realize, I think the Giants were better coached than any team in the league last year. That's how good I thought the coaching was. That's how good the head coach was. That's how good the defensive coordinator was. And the defensive coordinator was a star last year. He was a flat-out star, and they were a great combination. And as I said, I thought they were better coached in terms of game plan, in terms of preparation, in terms of getting what you can out of your talent. I thought they were the best coached team in the league last year. So I think their coaching is superior. I think they are building something that is going to be very good. I think they could be better, but not have a better record. I think that's very, very possible. I think the Jets, it would be very disappointing if they don't go to the playoffs, and I think Aaron Rodgers is going to have a very, very big year, but I do worry enormously about the offensive line. And yes, preseason, the way it is structured now, the way training camp is, training camp used to be a state of mind. Training camp used to be something the players dreaded, something the coaches loved. The idea of, especially in the days when you took your team away, and you put them in a college dorm, even when the Giants up in Albany, and put them in a dorm, and put them away from everybody, and had two a days. Two a days, remember two a days? Now they don't even practice hard. Now you're lucky if you see contact at all, if you go there to see training camp. I mean, you're lucky if you see anything. See a bunch of drills. I mean, you used to get 90 minutes of running game in the air in the morning, and then a two hour practice in the searing heat in the afternoon. I mean, those were the days. Training camp is now, you know, is now like day camp. But that's why the season gets off to a slow start. That's why you see a lot of missed tackles. You see a lot of sloppy play. You see a lot of special teams touchdowns. Because these guys have to meld the team as the season progresses now. They can't do it with training camp anymore. And in the old days, I think a lot of times guys knew, when they left training camp, what kind of team they have. There's no way they know now. Now they need two or three games minimum to know what kind of team they have. They never knew. They never needed that in the past. They now do because training camp doesn't allow them that look at their team anymore because of the way it's structured. I mean, the sport has changed radically. We know that. But nothing has changed more than training camp. And if you ever had a chance to experience what training camp used to be like, I'm not talking about the days when now they have their own training center adjacent to their regular facility and they don't go anywhere and everything. No, I'm talking about the old days when they used to pack up and take off and go somewhere and go to a college and put in six hard weeks or five and a half hard weeks. Those days are gone. We'll see you later."}, "podcast_summary": "In this podcast episode, Mike Francesa begins by talking about the upcoming football season and encourages listeners to download the Bet Rivers app for all their wagering needs. He then discusses the story of a horse named High Oak, who had a promising start as a two-year-old but suffered a serious injury and is now making a comeback. Francesa also mentions the upcoming race at Saratoga and the jockey Katie Davis who will be riding High Oak. \n\nFrancesa then moves on to talk about the New York Yankees and their struggles this season. He mentions the team's recent losing streak and the criticism they have faced. He states that while manager Aaron Boone may be replaced, he believes that the bigger issue lies with the team's configuration and the players themselves. Francesa suggests that the Yankees need to get younger, get rid of older players, and bring in left-handed hitters and a leadoff hitter. He also mentions the individual performances of certain players, such as Aaron Judge hitting three home runs in a recent game. \n\nFrancesa briefly touches on the New York Mets, stating that there is an anti-Pete Alonso campaign happening that is not fair to the player. He emphasizes the importance of Alonso and warns against trading him unless the team receives a significant return. \n\nFrancesa briefly discusses the recent political debate and criticizes the biased coverage from news networks. He then segues into discussing the preseason football game between the New York Giants and the New York Jets. He mentions that Aaron Rodgers will be playing in the game and discusses the importance of the offensive line for the Jets. He also mentions the potential for Waller, a player for the Giants, to have a great season and the potential success of both teams. \n\nFrancesa concludes by discussing the changes in training camp and how it affects the start of the football season. He mentions the lack of contact and the need for teams to mesh during the season rather than during training camp. He reflects on how training camps have changed over time and the impact it has on the team's evaluation of their abilities.", "podcast_guest": {"name": "Sir Nigel Sealy", "org": "", "title": "", "summary": "Not Available"}}
