{"podcast_details": {"podcast_title": "Fireside Giants - A New York Giants Podcast", "episode_title": "Is Kayvon Thibodeaux primed for a BREAKOUT 2023 season? | Giants Analysis", "episode_image": "https://www.omnycontent.com/d/playlist/0bdd4a2d-2e09-4198-8e56-aa4900702eb0/7b6324f5-0012-4f0a-a732-abdf00dae41d/1f6e9614-68e5-4030-b1dd-abdf00dae428/image.jpg?t=1666366247&size=Large", "episode_transcript": " How's it going New York Giants fans? Welcome back to Fireside Giants. My name is Alex, of course. We're talking about Cave-On Tibbito today, my friends. The Giants front four, if all goes to plan, could be very, very good. ESPN just ranked the Giants defensive line, the interior defensive line, as the number one interior defensive line in football. Now, the outside linebackers, Aziz Ojalary, Cave-On Tibbito. There's a lot of potential there. Not a lot of people are skeptical on Aziz Ojalary specifically because of the injury concerns. And while I'm not personally labeling him injury prone just yet, we got to see more consistency out of him. He gained like 10 pounds of muscle mass last year. Obviously, that didn't go so well for his lower body. Ended up with a calf injury that kind of shut him down prematurely. And he kind of was in and out the entire season. I think he only started in like six games and he had six sacks. So, you know, he was doing pretty well when he was on the football field. We're hoping he can put it all together. So far, so good during training camp. No injuries, knock on wood. But today we're talking about Cave-On Tibbito and the expectations regarding him and otherwise, could he be a breakout player for the Giants in 2023? Now, I really feel like he set a good standard for himself, a good benchmark during his rookie season in 2022. You know, put together some good games, four sacks, and you'd like to see a little bit more production there. And Cave-On Tibbito said it himself. He left a lot on the football field. He went through the film, looked at the tape and a lot of it showed production that he left out there. And I think that this is going to be a season where we see him put it all together in the sense that, you know, it's going to be a little bit more complete ever performance. Sometimes he would disappear for a quarter, then he'd show up in the fourth quarter. You know, we started calling him the closer. Last year, had a couple of those big moments against Aaron Rodgers, against Lamar Jackson. With that fumble, you know, he did some good things for this team. And ultimately, I feel like this is a player who athletically is gifted. He's charismatic. He kind of fits the New York media market perfectly. If he plays really well, he's going to be a star. He's going to be a hero among Giants fans. He's going to be a hero in the media. And a lot of the red flags that people said in the past, another was like a reporter from the Detroit Lions that came out a couple days ago and was like, Oh, like he looked like he was taking plays off. Like, does anyone really care that Cave-On Tibbito wasn't going 125% during practice? I personally don't, like don't get hurt. Like don't put yourself in a position where you're going to get hurt in miss time in the regular season, or whatever it might be. So far, he's been doing really good. And defensive coordinator Wink Marndell really tasked him with doing something specific, and that was improving his core and lower body strength. So he kind of went into this off season thinking, all right, like these are the things I got to accomplish. This is what I got to do. And it's, you know, kind of building on that core, building the lower body strength so he can expand his pass rush moves and also expand his ability to seal the run in the running game in defense. So you know, you're looking at a player now that pretty good grades across the board last year, if you look at his PFF grades, you know, there's a lot of context that are missing within PFF grades, but we'll look at the raw numbers, the raw stats of what he actually put on the football field. So, you know, looking at what he did as a pure pass rush, he had 45 total pressures. He had some truly dominant games, like in weeks four and five, he had four pressures in each of those. He had nine pressures against Dallas in week 12. The guy showed up like that was probably one of his best performances. He had five quarterback hits and four quarterback hurries. So that was a really, really, really good pass rush day for him. I think against those bigger teams, those better teams, he shows up and tries to do his best. And I think we're gonna see him like, you know, rookie season under his belt, he gets it now. Now we're gonna see him start advancing a lot of the other categories and kind of putting it all together into a more consistent player. He had four pressures a piece against the Washington commanders and Philadelphia Eagles in weeks 13 and 14. And they had another three in the Wilds card game against Minnesota, put together some really good grades there. He was a pretty good tackler throughout the entire campaign. He missed four tackles in the last one, the last seven, six games of the season. He didn't miss a tackle. He had a 6.8% miss tackle rate. He had 29 stops in the run game. Overall, this is a player that looked the part of a fifth overall selection and was a rookie. So taking everything with a grain of salt, you have to assume that he's going to compound on the success and get better. So what Wig Martindale essentially said to him, which I think was really interesting, he basically was like, I expect him to be at the top of everything. And so do we. He basically was like, Kayvon, we expect you to come in day in and day out and be the best on the field, be the best person defensively on both sides of the ball, whether it's the Lions, what's another opposing team, we expect you to go out there and make the biggest impact. And that's objectively what we're hoping he does. Now he went into Detroit and Wig Martindale said it himself. He had a family of two fumbles, forest and two fumble recoveries in two days of practice. I mean, you tell me that sounds pretty good. Kayvon Thibodeau came out to play, and he put out some nice plays. And I think ultimately, this is the kind of growth you want to see from a player of this, like a lot of people have claimed like, oh, he's lax in his effort, he doesn't give 100%. A lot of them not being Giants fans that actually watched him play. It's always like the random media heads that are saying absolute nonsense all the time. Oh, like he didn't do this, or he wasn't doing that. I'm like, like, who on your team is better than than Kayvon Thibodeau or has the upside that he does? I mean, I don't I don't really see any Giants fans complaining about Kayvon Thibodeau's effort that people that actually watch this guy week in and week out. I don't think I've ever seen anyone question his effort, or question like what he actually wants to do in the football field in all for all intents and purposes, I believe he wants to be great. And I think that he's voiced that. And I think that people are putting pressure on him, like Wink Martindale is challenging him, go get stronger, go produce, go be the guy that leads the charge, you know, put in that 100%. Practice is practice is there, it's scripted for a reason, you do things specifically to get better in certain areas. I don't think it always necessitates necessitates 100% effort because you could get injured in practice. But I do think that, you know, you you play as you train, it does have some sentiment there. So you know, there is there is a lot to like about Kayvon Thibodeau. But what I did like the most about him was the clutch factor that he had last year, you know, you watch Kayvon Thibodeau kind of show up late in games, made an impact. This is a guy who, you know, he wants to be the hero, like that's his character, he wants to be the guy that shows up in the final moments in the final seconds makes a big play happen. Everyone's cheering him on, everyone's loving him. Like you need guys like that, like that's ultimately where the giants are going to get a lot of production out of him in those big moments. And that's what wins football games, the game of the inches at the end of the day. So Kayvon Thibodeau, obviously, becoming that player is what we hope and we think he can do that. Now you look at the Giants off a defensive line, rather as a whole, they look at Aziz Ojalary, we discussed him for a moment, Kayvon Thibodeau, then look at Dexter Lawrence and Leonard Williams. I don't think we truly understand how great this unit could be. Like I remember two years ago, like Cup three years ago, we had like Kyler Fackerel, like O'Shaan Zimmin is starting games. You know, Marcus Golden, you know, love Marcus Golden at the time and obviously more of a backup. But you look at kind of what the Giants needed, and it was a lot more we needed upside, we needed youth. Dexter Lawrence found his own. Andre Patterson, you know, defensive line coach, formerly the Minnesota Vikings did wonders, like, I don't know what Dexter Lawrence did, but he found his potential. Maybe it was a scheme related shift, but he's just a bully. I mean, we know Dexter Lawrence is a fantastic player, and he warranted every penny of that deal that he just got. Leonard Williams, that last year was the first season that he's ever missed regular season games due to injury. Like this is a player that is durable. He is for his entire career been durable. Last year, he had an MCL sprain. Half our team went down to MCL sprains. I don't know why I don't know the cause of the reason could have been a specific exercise they were doing. But that was really weird. There were so many MCL sprains. It was like, okay, there's something going on here that they're doing that's causing this. He fell ill to that. He also had a neck injury. So, you know, when it comes to Leonard Williams, I feel pretty confident he's going to bounce back and be a very consistent player for us in 2023. Now this entire offensive line, defensive line as a whole has the potential to be top five in football, in my opinion, you know, if if cave on takes a big step forward of Zizo July maintains his health, you know, these starters are great the interior defensive line, Rikimunos Rochette. And also, and obviously you have a Sean Robinson and Jordan Riley's seventh round pick look good in the preseason game and DJ Davidson. You got some nice some nice players there are run defense is going to be probably the best we've seen in a long time. You have those big boys up front you can take extra Lawrence out for an early play or whatever it might be to give him some rest and make sure he's available and ready to go in the fourth quarter. That's obviously what you want. That's a perfect scenario. And then you got the linebackers Bobby O'Karrick, hey, you'll see how you know, Mike McFadden is leading the charge now. There's some good stuff going on there. So I like what I'm seeing so far, I think that the Giants could use a little bit more depth on the outside linebacker position. You know, there are some players out there, but it's it's it's thin pickings. Maybe they go out and look for an option off the waiver wire. Once the roster cuts down to 53 men, they try to like supplement that that way. But you know, got O'Sheaan is Jimenez got Timon Fox, there's some guys here that have some upside can contribute in ways. Are they great players? No, but they're serviceable depth pieces. And I think, you know, Fox made a couple nice plays last year, Zimenez stepped in valiantly for Aziz and stepped in valiantly for cave on tibet when they were out. And he's more of a pure pass rusher, not the best run stopper in the world. But he's a good pass rusher, he could show up in moments. So you know, you want to see some of that of Baldo nato had a good game, Bowers had a good game against Detroit. So we'll see out over the next couple of weeks here against Carolina and the Jets, if they if these depth pieces could kind of elevate their their performance and showcase what we need to see to be like, okay, like we can trust them to step in for Tibbs or step in for OJ, Larry and make an impact. But for now, cave on tibet, oh, I'm projecting him to have a really good second year. I know a lot of people say sophomore slump, a lot of people say, you know, this or that, but I think cave on tibet wants it, I think that they're not going to let him fail. Ultimately, like you see Wink Martindale, the way that they're putting pressure on him, the way that they're asking him to step up, I think that they've put it in his court, like they're they're asking him like, be a leader, be someone who dominates be a bet a really great player, be make a pro bowl appearance. I think cave on tibet wants it, I think we're going to see him really shine this upcoming season, a year under his belt. He knows he left a lot on the football field in 2022. And I think that the best days are ahead of him for sure. So guys, I love to hear your perspectives below on cave on tibet on this Giants defensive front. Obviously, any responses down below in YouTube comments are much appreciated. Much love as always make sure you like and subscribe. We'll catch you guys on the next fireside Giants episode."}, "podcast_summary": "In this episode of Fireside Giants, host Alex discusses the potential breakout of New York Giants player, Cave-On Tibbitto. He begins by mentioning that ESPN recently ranked the Giants' interior defensive line as the number one in football. Alex also talks about the skepticism surrounding Aziz Ojalari's injury concerns and the need for consistency from him. He then dives into Tibbitto's performance during his rookie season, noting that he had four sacks but left a lot of production on the field. Alex believes that Tibbitto has the potential to be a breakout player for the Giants in 2023. He discusses Tibbitto's athleticism, charisma, and ability to perform well in big moments. Alex also addresses the criticism of Tibbitto's effort, stating that Giants fans who actually watch him play have never questioned his effort. He goes on to highlight Tibbitto's statistics from the previous season, including his 45 total pressures and his performance in key games against Dallas, Washington, and Philadelphia. Alex mentions that defensive coordinator Wink Martindale has challenged Tibbitto to improve his core and lower body strength, which will enhance his pass rush moves and run defense. He expresses his confidence in the Giants' defensive line as a whole, including players like Dexter Lawrence and Leonard Williams. Alex believes that the unit has the potential to be one of the top five defensive lines in football. He discusses the need for depth at outside linebacker and suggests that the Giants may look for options on the waiver wire. Alex concludes the episode by projecting that Tibbitto will have a successful second year and showcases his determination and potential to shine in the upcoming season.", "podcast_guest": {"name": "Cave-On Tibbito", "org": "", "title": "", "summary": "Not Available"}}