{"podcast_details": {"podcast_title": "The Mike Francesa Podcast", "episode_title": "The Yankees' Collapse Didn't Happen in a Day", "episode_image": "https://megaphone.imgix.net/podcasts/5d54eee2-19af-11ee-aa5f-8f4f03b719aa/image/60854458c4d1acdf4e1c2f79c4137142d85d78e379bdafbd69bd34c85f5819ad.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Get a master class in betting from Sir Nigel Sealy. I've said before, hedging is for gardens, me press. Don't be a moron, put more on. Listen to Nigel and Betting Weekly Podcasts, exclusively on the Bet Rivers Network. Download the Betting Weekly Podcasts on Spotify, Apple, or wherever you get your podcasts. It's the Mike Francesa Podcast on the Bet Rivers Network. Hello again everybody and welcome to the Mike Francesa Podcast brought to you as always by the good folks at Bet Rivers. Remember for all of your wagering needs, go to the ever improving Bet Rivers app for everything you might need. And as we head closer and closer, inch day by day closer to the football season, and we do need it here in New York with the way things have gone this season. Looking so forward to the football season, remember it is Bet Rivers in New York and New Jersey. Play Sugar House in Connecticut and remember to just go to that Bet Rivers app where you can always find the podcast. Now, it's been a long time, really a long time, since the Yankees have been outclassed in a series the way they were outclassed in Atlanta. I mean, you could just see it. You knew as they headed to Atlanta playing the way they are and the way they have been playing. And you look at this Braves team that to the surprise of no one is having the kind of season that a lot of people knew they could have. Power, youth, dominance, up and down the lineup, strength everywhere. But the bottom line is the Yankees just so outclassed, shut out back to back games, five straight losses outscored 18-3 in the series. And find themselves in the very unfamiliar position of 60 and 61 after 121 games as the late days of August are upon us. The Yankees are under 500. As we said, this has been a long time coming. And I know there's a lot of debate now, day after day, everywhere and all the different spots about who's to blame and this and that. Well, listen, this doesn't happen in a day. This has happened over a period of years with a mindset. You know, there was a reason why when they were handed Stanton, I was vehemently opposed to bringing them into this team. Why? Because it did not fit what they needed. It was going to make them older. It was going to make them slower. It was going to make them less athletic. It was going to make them more right handed, dependent. And that's what they've become in so many ways. Tonight, the Yankees started one left handed bad. The Yankees, the Yankees who have been built on left handed power throughout their years of dominance, going back to Ruth. They have so little balance in their lineup. But it starts. It really started with a mindset. And again, just look at the age on this team. In a time when baseball has gotten younger and younger and more athletic and more athletic, the Mays is 35 and Rizzo when he's in is 34. Donaldson was 37. Even Judge is 31. Stanton is 33. He's an old 33. He can't even run the bases. The bottom line is this wasn't built in a day. There has been and I'll take it in the order of what I believe. Number one, it starts with ownership and an incredible inherited complacency. They are very happy at the top of this organization to fill the ballpark, which they do. Only the Dodgers drew more per game. The Yankees right now averaging 41,000 fans per game. To a very, very expensive ticket, to $40 parking and outrageous prices throughout the ballpark trying to steal a dollar from you wherever they can. To the configuration of the team, which deals with the general manager and the entire front office, together so poorly. The lack of left handed hitting, not only left handed power, but left handed hitting. The fact that they have had no lead off man for years and filling this roster with players who should never, ever wear pinstripes. And I'm not even going to get into some of the things that have happened as they've signed pitchers. Some of it unlucky. Some of it just incompetence. As they wind up with a shelf full of pitchers that don't help in any way and don't even get on the mound. Everyone always wants to blame the manager. And I'm not telling you that Boone has done a good job. But the bottom line is, nobody's going to win with this team. So it's not about the manager. I mean everyone is quick. That's the easiest fix. It's the easiest move to make. It's a harmless move to make. And it brings forth the aura of enormous change when really it's not enormous change. Ownership first, front office second, players third, then manager. The Yankees don't have a good organization anymore. They don't think the right way. They don't play the right way. They don't act the right way. And that's why they're in the predicament they're in right now. And it's not going to take a day to get out of it. It's not like you snap your fingers and this team is a hundred win team. It's not. It's gotten to the playoffs in a system now that makes it easier to get to the playoffs. And when it's gotten there, it hasn't done what it's expected to do, which is in the Yankee world or the old Yankee world, get to the series. You're not going to win the series every year. They didn't win the series every year when they had Ruth. They didn't win the series every year when they had Manil. They didn't win the series every year ever. But they got to the series all the time. And they were power and pitching and pride. And now occasional power, occasional pitching. I can't not call this year. And not a lot of pride. One of the things for the Yankees was they should be ashamed of is, you know, there are a lot of people live for their team, whether it's the Yankees, whether it's the Mets, whether it's any other team in the major leagues. But baseball is a constant companion. It's there every day. It unfolds. It's a great companion for someone who might be older, who might be infirmed, who might be housebound, who waits for those hours that they can just jump in and forget their problems and jump into the team an hour before the game, an hour to 40 minutes after the game, the game, and be there and have that to count on really day in and day out for six months. Instead now, in a absolute reach to claw every dollar, look what they've done to their audience and to their fan base. And for some people, it's impactful. I've heard from people, people stop me and say, hey, how did Yankees do this? I know they're on Yes now. And, you know, and I have to pay a couple of bucks for Yes. OK, I can do that. And then they might be on ESPN or Fox or something like that. And that's free. ESPN is not free, but it's everywhere. But now look at the Red Sox series, Apple Plus, then DS, then the Prime. A lot of people can't do that. A lot of people don't even know how to do that. And a lot of people can't afford that. And you would think they wouldn't thumb their nose at their fan base that way, at their very loyal fan base that way. It's just wrong. No one has a problem with a team making a buck. And we all know that they sure figure out a lot of ways to make a buck. And even in this awful season, I'm not telling people not to go to the ballpark because you know what? That's not right. They'll make their own decision how to spend their entertainment dollar. But what also isn't right is when you put them on Apple Plus on Friday and Yes on Saturday and Prime on Sunday. There's a generation that doesn't understand that. And there's also a lot of people out there who can't afford that. It's just wrong. You know, as the Mets go through this utter dismal finish to this season, there's no other word for it. It's just you have to be the diehard of diehards to sit through it. Well, you just have to love baseball. And if you do, fine. I mean, I admit I sit there and watch the ballgames. But if I have something to do, I'm not going to pass up anything else to watch the ballgame. But if it's there, I'll watch it. So I'm guilty, too. But there's very little to really grab your attention. So now what it's about is who do we blame? What do we get rid of? And obviously, a lot of this has fallen on Alonzo. He has been scapegoated here in recent weeks. And I've hinted to you throughout the year without being specific that there were some confrontations going on inside that clubhouse. That was no secret. And some of it was with Alonzo, not all of it, but some of it. But the Mets have to be very, very careful in all this talk about unloading Alonzo. This is a premier. Whatever faults he may have on and off the field, this is a guy who shows up every day and is a premier slugger. In the mold of a Harmon Killebrew. 53-120, 37-94, 41-31, 35-88 so far this year. Those are big power numbers year after year after year. Those aren't easy to find. Be careful giving him away. Now, obviously, the Mets have a huge problem in that they have no pitching in their organization and they have no rotation next year. And even with all Cone's millions, he's not going to be able to put together a good starting rotation. It's just not going to be available to him. And it would be insanely costly. But if you're going to send this guy away, just remember what he does. Look at the numbers. He dances every dance. Is he perfect? No. Is he a slugger? Yes. Does he make the plays in first base? Most of the time. Does he hit for average? No. Does he drive and runs? Yes. Does he hit on runs? Yes. And he hits him in a big way. Be careful about packing him up unless the deal is a very, very, and I underline, very sweet one. He should go nowhere. Build your team with him in the middle of it. Build it back with him in the middle of it. That's the smart move. You know, every day, whether it's hard knocks, wherever you move, everything's about the Jets and Aron Rogers. It's a very compelling story. Hey, whenever you have a legendary, and he's nothing short, but a legendary quarterback, he is a legendary quarterback. Not a good quarterback. He's a all time quarterback. So when he moves into New York to take over a team, that's a big deal. It's a very big deal. Then you put him with a bunch of weapons. And another one the other day in Cook, and if you've listened to me through the years, you know from the day he arrives at Florida State, I have been a big Cook guy. So I like that move. And they are loaded in the backfield, and they have plenty of wide receivers, and they have a whole lot of weapons, but they have an offensive line that it would keep me awake nice now. I'm looking forward to this Jets season. I think Aaron Rogers is going to have a very big season. But there's one thing that in a snap of a finger could destroy all these dreams and bring them crumbling down, and it's that offensive line. And they need help. They need insurance. And they need now, and I understand they went out and they made a deal for Cook. They desperately need to scour. And I don't expect them to find an offensive lineman that they can plug in and give major playing time that somebody's going to cut. It's not going to happen, but they need to make moves now, whether it's with Green Bay or whether it's with anybody else. They need to target unhappy or offensive lineman who have contract issues or teams that are having any thoughts of moving these guys, and they need to be turning over every option, because they need to bring offensive lineman in here now. They are not strong enough. They are exceedingly vulnerable on this offensive line, and that could destroy this whole dream. That could bring this whole show down quicker than anything else. And this is something you have to watch if you're a jet fan. Am I concerned about the coaching staff? Yes. Because Rogers is looking to have them take an enormous leap forward, a quantum leap forward. And frankly, I don't know if this staff is good enough. I know Rogers loves Hackett. I'm glad he does. Nobody else does. And I've never been a fan of his coaching, ever. And let's be honest. Sean should never have said what he said. It's breaking a lot of rules. But he was 100% right about what he said. The job that was done in Denver was just embarrassing. One of the worst we've seen anywhere. What he said was all true. He shouldn't have said it. We all know that. Coaches don't knock coaches. But he was telling the truth. But I'll live with that part of it. Because I think Rogers can run the offense. I'm just hoping that they get better in their game decisions, in their sideline communications, in their whole approach to how they coach the team. I hope they grow up with their quarterback. And try to see if they can coach on the level that he will quarterback at. That's very difficult. But while I have some concerns about the coaching, I have nightmares about the offensive line. And on this date, I really believe it is imperative that they try and do everything within their power. And try to see if they can improve this offensive line before the bell rings. Is it an easy task? No. Never easy to get linemen of quality or linemen who can help you in any way. It's very hard. You have to find a team that is maybe rebuilding or a team that just is overloaded that has guys they want to play. And they're willing to jettison someone who has a lot of life left because of his contract. That's what you need to find. The Jets have to sign some insurance policies for that offensive line now. Or they'll wish they did. They'll really wish they did. I have so many thoughts about the NFL on so many levels. I don't want to get into them all yet. I just wanted to get into that one right now. Because the Jets are so much the theme of the preseason, but also because this has to be done now. If it's not done now, it will not get done. Nobody's going to drop this guy in your lap in two weeks when they cut down. Nobody's going to drop down and cut a good player that you can pick up. They're going to have to be aggressive, they're going to have to be imaginative, and they're going to have to go out and be proactive to get themselves some help on the line. But they better go get it now. Because they're not settled there right now. Jets have done a lot of things right. I just hope they don't do this like they used to be. And I hope they don't do this in old jet fashion. Because this could really be a fun season. Their schedule is anything but easy, but you know what? They don't need their schedule to be easy. If they can patch up that offensive line, they can play with anybody in the sport. They can play toe-to-toe with anybody in the league. And when was the last time you said that about the Jets? I just hope Rogers gets to be Rogers here. The summer is slipping away. When you get to August 20th, when you see those continuous back-to-school commercials that drive you mad, you know that football is just days away. And we're really looking forward to it in this town. Why? Because there's a great reason for optimism. With both teams. And this baseball season has been just such a disaster. And there's going to be no October in this baseball town this year. But there may be a heck of an October in terms of football this year. I'd be surprised if there's not. We haven't talked at all about the Giants. We've got a lot to say about them. They're improved. But how big are the obstacles in their way? We'll get to that. But the Jets need to be working on one thing right now, and that is the great quarterback's protection. It's imperative. We'll see you later."}, "podcast_summary": "The host of the Mike Francesa Podcast discusses various topics in this episode. He begins by acknowledging the recent struggles of the New York Yankees, who have been outclassed in a series against the Atlanta Braves. He points out that the Yankees lack balance in their lineup and that their age and lack of athleticism are contributing factors to their struggles. The host places blame on ownership, the front office, and the players for the team's decline.\n\nMoving on to the New York Mets, the host mentions the current dismal state of the team and the blame being placed on Pete Alonso. He cautions against giving up on Alonso, highlighting his power numbers and consistency as a premier slugger. The host also discusses the Mets' lack of pitching and the challenges they will face in rebuilding their rotation for next season.\n\nThe host then shifts focus to the New York Jets and the potential of Aaron Rodgers joining the team. He expresses excitement about the possibilities that Rodgers brings, but also raises concerns about the team's offensive line. The host emphasizes the importance of the Jets addressing their offensive line issues to ensure the success of their season.\n\nThroughout the episode, the host shares his opinions on various topics, including the performance of coaches and the impact of scheduling in football. He concludes by expressing optimism for the upcoming football season in New York and contrasting it with the disappointing baseball season.", "podcast_guest": {"name": "Sir Nigel Sealy", "org": "", "title": "", "summary": "Not Available"}}