{"podcast_details": {"podcast_title": "Locked On Mets - Daily Podcast On The New York Mets", "episode_title": "Breaking Down the Top 10 Prospects in the Mets Farm System", "episode_image": "https://megaphone.imgix.net/podcasts/6989f14e-4b28-11e9-831a-9b8625db22a6/image/uploads_2F1553097247021-ph3t1txuzwa-2114e21569114113517b5aef84852962_2FLocked-On-Mets-Podcast-BG.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " It's the locked on podcast network, your team every day. This is David Harrison of the locked on commander's podcast here to tell you that us cellular knows how important your kids relationship with technology is. And they've made it their mission to help them establish good digital habits early on. That's why they've partnered with screen sanity, a nonprofit dedicated to helping kids navigate the digital landscape and for a smarter start to the school year, us cellular is also offering a free basic phone on new eligible lines, providing an alternative to a smartphone for children, start smarter with us cellular. Visit uscellular.com slash built for us to find out more terms apply. Who are the top 10 prospects in the Mets farm system? I'm breaking down my list on today's edition. Locked on mats. You are locked on Mets, your daily New York Mets podcast, part of the locked on podcast network, your team every day. Hello to all you, uh, amazing Mets fans. You're listening to locked on Mets. Part of the locked on podcast network, your team every day. Thank you for making locked on match. Your first listen every day, lock on. making Locked On Mets your first listen every day. Locked On Mets is free and available on all platforms, including YouTube. On the show today, we're going to break down the remainder of my list of the top 10 prospects in the Mets farm system. Last week, we did one through five. The first segment today, we'll do number six and seven. Then in the second segment, number eight and nine. And we'll close it with the 10th best prospect in the system, as well as an honorable mention who's so close, I almost had to put them head and head at 10 and 11. Before we get to any of that, though, I'm your host Ryan Ficklestein. If you want to find any of my work, follow me on Twitter, Ficklestein Ryan. You'll also find some of my writing at JustBaseball.com, where I work as the managing editor. Download the Game Time app, create an account and use code LOCKEDMILB for $20 off your first purchase. Last minute tickets, lowest price guaranteed. Last week, I broke down the top five prospects in the Mets farm system as part of my top 10. And I've been waiting a while to get the bottom half of this list out. So I wanted to make sure that I didn't delay it for another full week. And I really want to spend the time now to just get my full list out there because I spent a lot of time on it when I prepped that last show. And there was a lot of debate in my head on where to go with those prospects. For those of you who didn't watch that show or listen to that show, my top five was Luis and Hello, Cunha, Drew Gilbert, Jet Williams at number three, Ryan Clifford at number four, Ronnie Mauricio at number five. The first two prospects were the headliners in the Max Scherzer and Justin Verlander trades. Okay. Luis and Hello, Cunha came over in a one for one with Max Scherzer or for Max Scherzer. You know, Ronald Cunha, Jr.'s little brother, guy who already has over 50 stolen bases this year and could make the big leagues next season as a really flashy, he could be a shortstop, but because of the Mets having the door, it could be a great defense of second baseman, probably be gold glove caliber over there. And the guy that can get on base and steal a lot of them once he's there. Drew Gilbert, he's on a home run tear. He had another one tonight in Bigghamton. So he's really showing his stuff. He's been outstanding. That's coming over in that Justin Verlander trade. He's the number two prospect and the best outfield prospect in the Mets system. Number three is Jett Williams, who also homered tonight in Brooklyn. He's been unbelievable and high at 19 years old. So I felt he was deserving to be the number three prospects at the number four prospect. Ryan Clifford also came in the Justin Verlander trade. Did he homer tonight too? I feel like I just saw a bunch of tweets tonight about all of these guys hitting home runs. Clifford though has 22 or 23 on the season in high A and he just turned 20 years old, not that long ago. A really, really talented prospect, but I think has the best raw power in this system. The number five is Ronnie Mauricio, who we've certainly spent enough time talking about over the last couple of weeks. So that's my top five. And the thing about it is three of those names were not in this organization a month ago. And that shows you how much deeper this farm system got because as we start to filter through these names, you have to imagine all of them being bumped up three spots. So as we get to my number six prospect in the Mets system, which is Blade Tidwell, it's great to see him in that six spot for me. If he was your third best prospect, I feel a lot different about this system right now, because while Blade Tidwell is a very good pitching prospect. I feel a lot better with him being outside the top five than inside and even more so in the top three. I mean, this is a guy that still has a lot to prove, but he's had a very good first full season of professional baseball last year, drafted in the second round out of Tennessee. He turned 22 years old in June. He's six foot four, has a great fastball and everything is predicated off that. Also a good slider. I think he's been working with, I don't know if it's a different pitch, but I know he was talking about getting more sweep to his breaking stuff. Maybe it is more of a sweeper now. But I think the thing about Blade Tidwell is, is he going to be able to complement that fastball and look, coming into the baseball America had his fastball and his slider graded at a 60. So that's the 20 80 scale for prospects. It's hard to find 80 grade anything. That means that it's just like surefire can't miss 60 grade is really, really good. So baseball America coming into your head as a having a great fastball slider combo. Can you develop that third pitch so far this year to look at what he's done in high a made 17 starts pitched to a 309 era struck out 12.3 batters per nine. You know, and all together on the season, he's got 21 starts and 102 innings pitch with 132 strikeouts. Now that many innings pitched in his first professional season is a great sign when you're developing a starting pitcher. That's awesome. You know, let's say he finishes out this year healthy and gets that over 120 innings, maybe even pushing 125 130 all of a sudden next year can have that next bump up and you might get over 150. So that's a really big part about developing starting pitching. And that's one of the reasons why I had him so high on this list. The other is just that his stuff I think is better than any other pitching prospect the Mets have in double like he struggled a little bit, but that's a big, big jump. Okay. And he's had a bad start. I can't remember how many runs to give. He had one really bad start. He's a four eight seven era and his last start this week, he went five scoreless. So you look at the overall numbers, they're all down. The strikeouts are down, but the walks are down too. So I think he's still competing and next year is going to be here. We will start in AA again and really try to make that rise up the system. Outside shot of a 2024 ETA, but more likely 2025. But the one prospect that you look at that you would hope has some frontline starter potential. More likely outcome is probably a three, but he's a guy that you can dream on a little bit. So because of that, and maybe sometimes I'm not the prospect analyst of prospect analysts that this is not, I cover the big league team and I, and I do this as well. But you know, when it comes to my grades, sometimes I have to be honest, the lack of arms in the system to me vaults a guy like Ted well up a little bit more. Maybe if you're a straight prospect analyst, you just have your own way that you evaluate these guys and you would stack up the value of a catching prospect like Kevin Perata and you know, a guy that would be a everyday position player who has a really good hit tool and say that is more valuable than starting pitcher that I'm not positive is going to stay in a rotation because of course there is still some reliever risks with played Ted will, but I think if he did end up as a reliever, he'd be a very good high leverage one. The way he's pitched this year though, I'm getting more and more assuredness that he's going to stay as a starter to me. That's what made him number six. And then that obviously leads to my number seven prospect that I just alluded to there, which is Kevin Perata. I'm a little bit down on Kevin Perata. I've seen some people have products high as number three in their top 10. So going into the year of that was even where he started out from some. I mean, everyone was very high in Kevin Perata for good reason. He was a consensus top 100 prospect. He was the 11th overall pick in the draft last year. People were kind of surprised that he fell to 11. He hit three 61 Georgia Tech, four 53 on base, seven Oh nine slug. He had 26 home runs in 60 games, Georgia Tech. This year though, he's played pretty much exclusively in Brooklyn. He had a couple of games in St. Lucie on a rehab assignment. He's in two 63, three 44, 47, seven 88 OPS. His WRC plus is one 14 WRC plus his way to runs creative plus measuring hitters based on a league average of a hundred. So he's only been 14% better than your league average hitter and he's only hit 11 home runs. He's got 20 doubles, four triples, 41 RBI. The lack of home runs and the fact that he's not necessarily regarded as a great defensive catcher and look, I'd be lying if I told you I've been watching a ton of Brooklyn cycling games and watching how he's receiving back there, but you can read what's out there and there's no one that's raving about his defense. So he needs to sort of carry his profile with the bat and I would have expected him to put up better numbers in high a this year. That's a little bit concerning. So the fact that blade Tidwell beat him to double a that alone makes me want to put Tidwell above and that's part of what went into the calculus there because I would have gone into the season betting on Parata as the advanced bat hitting in high a to hit himself out of there quickly and move up to double a and it just hasn't happened. So we'll see. There's no reason to give up on Parata. He's still a relatively young prospect. He is 22 as well. So yeah, goes out next year and maybe starts the year in double a and you see how he handles that jump. We'll see. We'll see. He could come out and hit the ground runner next year and change the perception and vault right back up into the top five where he's supposed to belong. But that's how I looked at those two prospects and I think as we get to the rest of this top ten list, it does fall off a little bit from there and I'll explain why as we get into number eight and nine in the next segment before we do though. Today's episode is brought to you by game time. Have ever been in the situation where you want to go to the game but find tickets is so stressful you ultimately decide and just you don't want to go. Well game time is a fast and easy way to buy tickets for all the sports music comedy and theater near you with killer deals on last minute tickets and their best price guarantee so you can stop stressing over the tickets and start getting hyped from all the fun you're going to have at the game. The game time guarantee means you'll always get the best price. If you find tickets in the same section or row for less, game time will credit you 110 percent of the difference. It's the fastest growing ticketing app in the country for a reason. Get images of your seat before you buy so you know exactly what to expect when you arrive. Buy tickets in a matter of seconds. Two taps you're all set. Tickets are sent directly to your phone so you never have to dig through your email. You can snag tickets without the stress with game time. Download the game time app, create an account and use code LOCKDOWN it will be for $20 off your first purchase. Terms apply. Again create an account. Deen code LOCKDOWN it will be for $20 off. Download game time today. Last minute tickets lowest price guaranteed. This is David Harrison of the Locked On Commanders podcast to draw your attention to the taste that's going down in the bread aisle. All thanks to Dave's Killer Bread, bread amplified. Anyone can bake bread, few can rock it and Dave's Killer Bread is the champion of killer taste, killer texture and is for those who want to rise above the boring. Organic and healthy doesn't have to mean boring when it's made with the highest quality organic and non-GMO ingredients packed with whole grains, fiber and protein. 21 whole grains and seeds bread has a subtle sweetness and a seed coated crust while good seed products are the boldest and sweetest of all. Dave's Killer Bread was built on the belief that second chances can change lives because after spending 15 years in prison, not only did the guy with the guitar you see on every loaf turn his own life around, he's helping others to do the same by hiring the best people for the job. Regardless of their background, he's ensuring your mornings no longer taste like cardboard. Your taste buds don't have to feel sedated and your sandwiches can become superstars. Visit Dave'sKillerBread.com to learn more and look for Dave's Killer Bread in the bread aisle of your favorite grocery store. All right, so now let's get to my number eight prospect in the Met's farm system. And I said the list falls off and that's not to knock these two guys that we're going to discuss here. It's more to illustrate that there is a lot less guarantees when we get to this part of the top 10. I think if you look at the top five prospects in the system, there's a combination of guys who you're pretty confident are going to be big leaguers with Acuna, with Gilbert, with Mauricio and guys with just immense upside who have already started to show it with Jet Williams and Ryan Clifford. Number six and seven, you have high draft picks out of colleges who are still high probability big leaguers. No matter what Kevin Perotta has done this year offensively, you would imagine that at some point based on the potential his bat has and the position he plays, Kevin Perotta can find himself up at the big league level with the shot to see what he can do. And Blade Ted Williams said the same thing about him joining a rotation someday. Now we get to 18 year olds and that's where it drops off because we don't know what these guys are going to become. But a lot of people really liked the Mets first round pick this year and that's why I have him slotted number eight. That's Colin Howe. He ended up drafted 32nd overall. He came out of high school. He was a two sport athlete. So he was a three star quarterback and he actually got some scholarship offers from power five schools. So he was a legit football prospect who did both. And he just recently at the end of his high school career switched and focused on baseball. Decided that was his path and he was great as a senior. Okay. He hit 487, 589 on base, 857 slug, eight home runs, 16 steals. He won the Gatorade player of the year honors in the state of Georgia. And when you look at the draft grades from lmb.com, they had him graded at 50 for fielding, 50 for running, 55 for power, 55 for hit, 60 grade arm and a 55 grade overall. That's a really solid foundation. Okay. He's not bad at anything. Now he's 18. He's got to learn how to hit in professional baseball. He's got to learn how to be a professional. A lot has to still go right despite the upside and even the high floor based on everything we just discussed there. But he's a really good athlete who has a chance if he continues to develop as a hitter to be just an all around player. It's not completely dissimilar to the jet Williams draft pick last year. And that one is working out extremely well. So we'll see how he performs, but he's barely even hit in the complex league yet. So there's only so much that we can take from pre-draft grades. Still though, I think when you weigh out the upside compared to the other guys in this top 10, I had to put him at eight. Number nine is Marco Vargas. He came over in the David Robertson trade. He was the headliner with, I think I called him Robert Hernandez yesterday. It's Ronald Hernandez, the catching prospect who was ridiculously good in the complex league with the Mets. Vargas, it was kind of the other way. He was great with the Marlins. He didn't really do all too well with the Mets, although he still had the good plate discipline drawing his walks, not striking out a bunch. In the Florida complex league, which is obviously very young prospects, but he walked at a 21.9% level, he only struck out at a 14.2% clip. And in 48 games, he had 270, 434 on base, 401 slug. They've now called both Vargas and Hernandez up as the Florida complex league ended. They now are going to get a little bit of St. Lucie action. And then of course, next year, those guys will probably be the stars of the St. Lucie Mets along with HALC. And we'll see how they all end up developing, but a lot of people are high on Vargas. There's been more scouts professionally that have been able to see him on the backfields in spring training and then the complex league and everything else. So there may be a little more information on him as a professional than HALC, but I think HALC's upside and just well around the game put him ahead of Vargas. But I really look at these guys as similar prospects where either one of them could be the one that next year tears up St. Lucie and is starring in Brooklyn by mid season. You're like, all right, that guy has vaulted himself into the top five. I think both of them have top five in the system upside and they both might reach it. So it's really exciting to pair those guys together at this part of the top 10. And the big thing about him, and again, why I said that it dropped off is just the unknown factor of 18 year olds. When it comes to the final two prospects, we'll discuss today. They are not 18 year olds. Couple of pitchers who I think have a chance to contribute at the big league level next year and we'll discuss them in just a minute. First though, another word from our sponsors. NFL Sunday ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan. Even if you live far away, like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday ticket, your out of market team is never more than a short distance away. Specifically the distance from you to remote control. NFL Sunday ticket now on YouTube and YouTube TV. Go to youtube.com slash pre-sale to get $50 off. Terms and embargoes apply. All friends, 919, no refund. Subscription auto renews. 20th century studios presents vacation friends to now streaming only on Hulu. Look at us all together again. We just wanted to give you guys a real honeymoon. Shots, shots, shots. He was just released from jail. Where can I get a drink around here? Back on vacation. This place is nice. It's drug lord nice. I'm sorry, drug lord nice? With more baggage. Ever since he showed up, he turned this relaxing vacation into total chaos. Who does that? Vacation friends too. You are now streaming only on Hulu. All right. So to close out our top 10, really top 11 prospects in the Mets farm system, got a couple of guys here. And the reason why I wanted to do 11 is because I don't think the gap is that great between these guys. I think if you get to the gap between 11 and 12 in the system, it's a lot wider. I think they're very, very close, these two pitchers. And honestly, you know, if Ryan Mauricio had debuted earlier this season, they'd both be considered top 10 prospects in the system. And obviously Mauricio is going to continue to be a prospect going into next year. At some point you think he's a big leaguer and it would slide these guys up. So if you're sort of framing your mindset towards 2024, who the top 10 prospects in the system will be, I do think they're both be included in that. And to choose between them is really hard because I'd almost call it even in some respects. But if you've been listening to the show over the last month here, as I focused more on prospects, you know, the two names I'm talking about and you know who I like more and that's Christian Scott and Mike Vassal and the guy I have a number 10 is Christian Scott. Now the reason I am viewing Scott ahead of Vassal is based on what we have seen this season. He dominated so far. Okay. Six starts in high a pitch to a two to eight era. Ten starts in double leg 2.67 era. Here's the thing. He made that jump from high a to double a seamlessly and that is a tough, tough jump to make. But this guy did it with no problems. His whip 0.80 high a 0.84 double a strike up for nine 10.27 high a 10.83 and double a walk per nine 1.52 high a 1.26 and double it over his last five starts. Pitch to a 1.93 era, pitch at least six innings in three of those outings went eight innings in one of them. He struck out 37 and 20 innings pitched during that five start span. He's a fifth round pick in 2021. He's 24 years old. Now he actually apparently is on the injured list right now. Very hard to know what it is in the minor leagues when a guy goes down. They pretty much keep all that stuff pretty tight lipped. It could be simple arm fatigue. It could just be hey innings limit. Last year you threw 58 and two thirds. This year he's at 83 innings. So he's nearing a 30 inning jump already. Sometimes that's what they want to do about a 30 inning jump. Maybe they're holding him out a little bit and then they're going to put him back in the rotation to make three starts at the end of the year. Try to close it out strong and maybe get him over 100 innings. I could see that. Maybe the idea was to get him to 100 and he's at 83. So if they kept him in the rotation, he made five, six more starts. He would go over that. That could be it. But the reason why I have him over Mike Vassal is because I think there's a higher probability of him being better than a backend starter than Mike Vassal. And look, people say, oh, a guy, a prospect has a high probability of being a number five starter and a lot of people look at that and they think, oh, then what value does he bring? You got to understand that saying he's better than what Tyler McGill has shown. Tyler McGill has not shown that he's a number five at the big league level. David Peterson has not shown that he's a number five at the big league level because they haven't been consistent. If you get a guy that's consistent at pitching to a low four ERA and isn't just a constant train wreck, that's extremely valuable. And it's not to say that's what Vassal is going to be, but I think that you're getting closer and closer to a point where Vassal is going to make his debut. And what we've seen in Syracuse this year is a guy's pitching an ERA over five. And earlier in double A, 10 starts, he did pitch to a 3-7-1 ERA, but Christian Scott in 10 starts in double A, pitched to a 2-6-7 ERA. Now it's different points in the season, but Vassal last year found his way up to high A. Scott had to start a level below this year. Vassal started in double A. Now, triple A was a big jump for him. He struggled a little bit. He has been better. It was the last three starts. He has a 1-8-3 year. I would love to see him in the big leagues this season. But when I project out the future, I just think the upside is a little bit more there with Scott. And I don't even know if the floors are that much different at this point because Christian Scott's ability to limit walks this year, attack in the zone and not get blown up and to really show great command of that fastball and a really nice slider. I think both of these guys are, can you really develop a great third pitch to pair off your top two and be able to face alignment three times in a row in the big leagues? That's tough to make it through that lineup a third time through. We'll see if either of them gets there. But of the two, I have a slight edge on Scott at this stage. Hey, Mike Vassal comes up, looks great this year. Who knows? Maybe as we get into our preseason top 10, maybe I'll change my mind on that. For now though, that is my top 10 list to reiterate. Number one, Luis Angel and Hella Cunha. Number two, Drew Gilbert. Number three, Jet Williams. Number four, Ryan Clifford. Number five, Ronnie Mauricio. Number six, Blade Tidwell. Number seven, Kevin Perata. Number eight, Colin Hauk. Number nine, Marco Vargas. Number 10, Christian Scott. And the honorable mention 11th is Mike Vassal. Anyway, that's going to be all for today's edition of Locked on Mets. Make sure you follow, rate and review wherever you get your podcasts. Follow me on Twitter, PickleStineRyan. Follow the show at Locked on Mets. If you want to catch every pitch in the Mets hometown broadcast this weekend, you can do so with SiriusXM on the SXM app. Just search Mets. Buying tickets to your favorite events should never be stressful. That's why you need to download the Game Time app today. Forget about planning in advance. Game Time has deals on tickets right up to the day of the event with exclusive flash deals on tickets for football, basketball, baseball, concerts, comedy, theater and more. And with the Game Time guarantee, you'll always get the best price. Get images of your seat before you buy with tickets sent directly to your phone so you never have to dig through your email. Download Game Time today. Last minute tickets lowest price guaranteed. Hey, Prime members, you can listen to this Locked on podcast ad free on Amazon Music. Download the Amazon Music app today. The MLB regular season is coming to a close, but the excitement is just getting started. For all your MLB pennant race needs, join your baseball buddy, Stully, as he brings you all the insights you need for the September playoff push on Locked on MLB. Who will finish at the top and who will just miss out on the last spot? Find out all this and more on Locked on MLB, available on YouTube and wherever you get your podcasts. Part of the Locked on podcast network, your team every day."}, "podcast_summary": "In this episode of Locked on Mets, the host breaks down his list of the top 10 prospects in the New York Mets farm system. He starts by recapping his top five prospects from the previous episode: Luis and Hello Cunha, Drew Gilbert, Jet Williams, Ryan Clifford, and Ronnie Mauricio. He then moves on to his number six prospect, Blade Tidwell, a pitching prospect who has had a solid first season in professional baseball. Tidwell has a great fastball and slider and has shown potential to be a frontline starter. The host also mentions that Tidwell's ranking is higher due to the lack of pitching depth in the Mets system. The number seven prospect is Kevin Parada, a catching prospect who has not performed as well as expected this season. While he still has potential, his lack of offensive production and questions about his defense have led to his lower ranking. The host then discusses his number eight prospect, Colin Howe, who was the Mets' first-round draft pick this year. Howe is a versatile athlete with power and speed and has the potential to be an all-around player. The number nine prospect is Marco Vargas, who came to the Mets in a trade. Vargas has shown promise at the plate and has a chance to be a top-five prospect in the future. Finally, the host discusses the number 10 prospect, Christian Scott, who has had a dominant season in the minor leagues. Scott has shown great command and has the potential to be a backend starter in the major leagues. The host also mentions Mike Vassal as an honorable mention, as he is a close contender for the top 10. Overall, the host emphasizes the uncertainty in ranking prospects and mentions that the gap between these prospects is smaller compared to the rest of the top 10.", "podcast_guest": {"name": "David Harrison", "org": "Locked on Commander's Podcast", "title": "", "summary": "Not Available"}}
