{"podcast_details": {"podcast_title": "Locked On Jets - Daily Podcast On The New York Jets", "episode_title": "Aaron Rodgers Has Successful New York Jets Preseason Debut 8/28/23", "episode_image": "https://megaphone.imgix.net/podcasts/70a387f6-b812-11e7-8150-f30c88c9588e/image/uploads_2F1551393571288-4pxskkz9ko6-ea29a76f0f49af99102535354419057e_2FLocked-On-Jets-Podcast-BG.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " It's the Locked On Podcast Network, your team every day. Get ready for the NFL season with incredible offers from FanDuel, America's number one sports book. Right now, new customers can bet $5 and get $200 in bonus bets guaranteed. Plus, all customers who bet $5 will get $100 off NFL Sunday ticket from YouTube and YouTube TV. This is the best time to join FanDuel. The app is easy to use and you can bet on everything from spreads to player props and more. So visit FanDuel.com slash Locked On and kick off the NFL season with an offer you won't want to miss. FanDuel, official partner of the NFL. Aaron Rodgers does the job as the Jets win their preseason finale. Talk about it today on Locked On Jets. You are Locked On Jets, your daily New York Jets podcast. Part of the Locked On Podcast Network, your team every day. Welcome. This is the Locked On Jets podcast, part of the Locked On Podcast Network, your team every day. I'm your host, John B. from gangreenation.com. Thank you so much for making this show your first listen or first watch every day. Subscribe to the show for free on YouTube or wherever you get your podcasts so that you'll get new episodes as soon as they're posted. You're listening to the show on a podcast source and enjoy it. Please give it a five star review. And if you're watching on YouTube, give this episode a big thumbs up. Today's episode of Locked On Jets is brought to you by Game Time. Download the Game Time app, create an account and use promo code LOCKEDONNFL for $20 off your first purchase. Last minute tickets, lowest price guaranteed. Well the Jets defeated the Giants in their preseason finale Saturday night at MetLife Stadium. The final score was 32 to 24. Nobody really cares about the final score though. Today we're going to talk about what happened in the game. The Jets finished their preseason with a two and two record, which is not in and of itself significant. There are things that happened within the game that are more significant than the final score because remember, preseason games are not decided by the players who are going to decide regular season games. And when you talk about the New York Jets in the year 2023, there's no player who's going to play a bigger role in deciding the outcome of regular season games than Aaron Rogers, the Hall of Fame quarterback who the Jets traded for in the off season made his debut in a Jets uniform. I mean, it's not official. I think his official debut is really Monday night, week one against the Buffalo Bills. But it was the first time he was on the field in a Jets uniform in a game situation. And the numbers were, you know, they were okay. Five of eight, 47 yards, a touchdown. I think if you watched it though, it was more impressive than the numbers look because he got the ball where it needed to go. And if you watch, there was one play, it was a touchdown pass to Garrett Wilson. And you probably think that looked really good. And I'm here to tell you, you're probably wrong because as good as it looked, the play itself was actually better than what met the eye. Now, it was a pinpoint throw. There was a very tight window. The ball was absolutely on the money. It was perfection. But the play was actually better. I think people don't realize this. So let me take you through what happened on that play. That was actually a run play. So if you watch the replay of it, and I saw it from a couple of different angles, it was very easy to miss this. But if you look at the way the guys were blocking, and one of the giveaways is one of the guards was kind of blocking to seal a guy off from the right side of the formation. So the run was going to the right, and one of the guards kind of just threw a block to seal the defender off from getting to the right side of the formation. His block, however, left the defender with a clear path to the quarterback. So that's a dead giveaway that was a run play to the right, because he was trying to block, he was trying to seal off the right side of the formation, not the path to the quarterback. And also, if you watch the play, the two running backs were kind of acting like they were going to get a handoff and block. The fullback looked like he was going to block. The tailback looked like he was getting a handoff. There was no play fake there. The receiver on the other side of the formation, who was not Garrett Wilson, really was not running around. He was essentially looking like a receiver would look if he was blocking on a run play. So this was a run play called. And what happened is, and I heard a little bit from the postgame comments, so I want to give Conor McGovern a little credit here, because it sounds like Conor McGovern was part of this mix. But Rodgers and McGovern saw the alignment, and they saw that maybe a run play was not going to be successful. And they saw that they liked the matchup that they had on the outside with Garrett Wilson, and they saw the pre-snap alignment of the corner meant that the fade route was going to be there. So what did Rodgers do? Well, he just, he didn't really change the play. It wasn't really inaudible because nobody else really, everybody else ran the originally called play. Everybody else was acting like it was a run play. But Rodgers and Garrett Wilson kind of just changed it up. And they said, you know what, we got a shot to score a touchdown here. And I'll tell you, with almost any other quarterback in the NFL, that's going to be a run into the line for like two or three yards. It's the difference between having the elite veteran quarterback and a young quarterback, not even a bad quarterback, even like a good young quarterback may not be able to make that play. Because first of all, he may not recognize the alignment that he's got a matchup that he really, that's really good. Garrett Wilson one on one, and the pre-snap alignment of the corner means that the fade route is going to be open. A young quarterback may not have the guts to make that throw. And I'll take it a step further. A young quarterback may not even have the green light to try and attempt that play. So when you hear about what the difference Aaron Rodgers makes, sometimes it's the tangible things. Like that was a great throw. I think anybody could see that Aaron Rodgers made a fantastic throw on that play. But there was so much more that went into it. Aaron Rodgers is just on another level pre-snap. And one point I always try and make when you talk about the quarterback position, it's a physical position, yes, but I think it's even more of a thinking position because defenses in today's NFL are so complex. But when you have a quarterback who is smart enough to figure out exactly what the defense is doing before the snap and knows exactly how to beat it and can essentially just change the play on the fly. And he did that one. It was another time or two where Rodgers threw what's known as a smoke route where run play was called and you saw, you know what, they're giving my receiver too much cushion. I'm just going to take the snap and throw it out to him. And when you talk about the concept, either there's an old phrase, expanding the playbook, that might be like the ultimate example of it because there aren't many quarterbacks in this league where the Garrett Wilson plays a touchdown. Almost everybody else just going to run into the line. And that's what you're getting when you get top tier quarterback play. And from my perspective, as a podcaster and a writer, it's really exciting to see something like that because I've watched years and years of the Jets just doing nothing interesting on offense, lots of like stagnant stuff that doesn't work. So from my perspective, from that standpoint, it's a lot of fun. But if you're a Jets fan, it's like the most amazing thing in the world because after years of bottom tier quarterback play, guys just had no idea what they're doing. The Jets trying and failing to develop young quarterbacks. This was a little glimpse into something special that could happen this year where you have a guy who is a future Hall of Fame quarterback, one of the undoubtedly one of the top 20 players to ever play the game. You could argue one of the top 10 quarterbacks to ever play the game. And he just has an incredible understanding of the position. If you recently watched an interview with CJ Uzama, where Uzama talked about how Rogers is just so smart that he passes along like these keys to figure out how to read the defense. He passes along to the receivers. He passes it along to the offensive linemen. Just little tips that make your life easier pretty snap. He just figures out how to diagnose this stuff. And it's the type of thing that just makes everybody better. Now do we want to go too crazy over two drives, one of which ended in a touchdown? No. But I'll tell you, I'm really happy the Jets scored that touchdown. I'm really happy Rogers threw that touchdown pass because right or wrong, and I think for the most part it's wrong, we've seen it happen over and over. It happens all the time. And I'm just happy that if we're going to overreact, it's going to be for something good that we're going to maybe go a little too crazy about one touchdown drive. Because I really was kind of dreading if Rogers went out and they punted a couple times and maybe the offensive line didn't look good, the overreactions that would come from something like that. So we get to react. And it's an overreaction to say that those two drives mean that the Jets are going to have a great offense this year. But I don't think it's an overreaction to say this is the type of thing Aaron Rogers brings to the table. This is the type of thing that makes a football team better. This is the type of thing very few teams get. I mean, we've had in New York, we've had quarterback play that's just absolutely bottom of the league. We've had quarterback play that very few teams get, but in a negative sense, when we've had Zach Wilson and Sam Darnold and all of the disaster quarterback plays the Jets have had really going back to 2009. Now we get this year, we get to watch great quarterback play. It's going to be such a contrast. And this was a little bit of glimpse into that. Now, head over to the Lockdown Jets podcast. We'll continue this Monday episode. And we're going to turn our attention to the defensive side of the ball. A couple of guys who have had strong preseason at the defensive end position kept it up. And we'll talk about what that means as we continue this Monday game recap edition of Lockdown Jets. Today's episode of Lockdown Jets is brought to you by Underdog Fantasy. Get championship ready for your home league by trying out best ball on Underdog Fantasy. All you do is one live snake draft, no waivers, no trades. Underdog sets your best lineup every week. And try it out with Underdog's best ball mania tournament. The largest fantasy football contest of all time is back and bigger than ever with $15 million. That's right. $15 million of total prizes up for grabs, including an absurd $3 million. Again, $3 million going to the winner. And last year, the winner drafted their team in July. So don't wait around. We're near the end of August. Last year's winner drafted their team in July. So hurry up and draft your team. Visit underdogfantasy.com or find them on the app store to sign up with promo code LOCKDON to get your first deposit doubled up to $100. Again, that's underdog fantasy promo code LOCKDON. It's one word with no space, L-O-C-K-E-D-O-N. Underdog is the easiest place to play fantasy football and the best place for best ball. Again, get your first deposit doubled up to $100. Underdog fantasy promo code LOCKDON. NFL Sunday Ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan, even if you live far away. Like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out of market team is never more than a short distance away. Specifically the distance from YouTube remote control. NFL Sunday Ticket now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. Offer ends 919. No refund. Subscription auto renews. Don, thank you so much for making LOCKDON just your first listen or first watch every day. Big shout out to you every dayers, folks who listen to this podcast on a daily basis. We have new episodes through the week, Monday through Friday, five new episodes a week, plus bonus episodes if we need them, if there's breaking news we need to discuss. And once again, big shout out to everybody who lives in France, Greece, United Kingdom. I visited those three beautiful countries the last couple of weeks and we do have some listeners from those countries. So one more time, thank you so much. Your countries are absolutely beautiful and I can't wait to go back. But today we're breaking down the Jets preseason victory, the final score, who really cares? It was, if you're interested, if you do care, it was 32 to 24. Jets defense kind of faltered near the end of the game. But I'll tell you what I liked from the defense. Jermaine Johnson, the sack, Bryce Huffa sack. Once again, these depth guys delivering for the Jets in preseason. Yeah, they were going up against backups. Giants really not playing their starters that much. But these guys are kind of second stringers for the Jets because your starting defensive ends are really Carl Lawson, who's nursing a back injury. So hopefully he gets back soon. And John Franklin Myers. And it just shows you the great depth the Jets have up front on the defensive line, especially at the defensive end position, because you also have the first round pick this year, Will McDonald. I see people complaining that the Jets have too much depth at the defensive end. How can you have too much depth at the defensive end? That's a rhetorical question. Please don't answer that. The answer is you can't. There's no such thing as too much depth at the defensive end. I can't imagine four years ago when the Jets had like no edge rushers, when Jordan Jenkins was the best Jets edge rusher complaining that there's too much defensive end depth. And it shows, is producing in preseason necessarily significant? No. But when you have two guys who are dominating preseason against backups, and they're your backups, they show that they are quality depth. Your two should be beating their twos. And with the way Robert Salla likes to rotate his defensive line in and out, these guys will both have ample opportunities. This Jets defensive line is really interesting. I was thinking about this over the weekend because outside of Quinn and Williams, there's not really any like elite level player. They're just a lot of very good players. So a lot of like a top defensive lines, they'll have a couple of like elite players. So the way they produce great results is like 70% of the time those guys will play. So 70% of the time you get elite level snaps. And then the other 30% of the time when the backups are in, you get okay snaps. The Jets are a little different because you're not getting a ton of elite snaps, but it's almost like 100% of the time for the Jets, you're getting very good snaps. So instead of 70% elite, 30% okay, you're just a very good 100% of the time. Jermaine Johnson looks a little faster this year than he did last year. Now getting going up against backups this year, but we're looking for Jermaine Johnson to make a leap this year. And while you can never guarantee anything after a preseason, if Jermaine Johnson was going to make a leap this year, what would I want to see? I'd want to see a big training camp while he's had it. And I'd want to see production in these preseason games. I'd want to see him looking like a man amongst boys going up against backups. And I got to say, I think we've seen it so far. So Jermaine Johnson, how much is he going to improve? I think you're going to see a better Jermaine Johnson. I think you're going to see a more productive Jermaine Johnson this year. And if he does that, my goodness, that 2022 draft class somehow gets even better. So Jermaine Johnson looking really good. And I think it's fair to say, you should be optimistic about the way Jermaine looks so far in preseason and also from the reports coming out of training camp. Because every indication is there right now. And again, we need to see what happens. Now, the next step is step three is doing it in the actual games. But what we've seen so far, he's taken every step he's needed to take if this was going to turn into a breakout campaign for him. And as far as Bryce Hup goes, I mean, I think we're at the point where the Jets have to start looking at playing him on some early downs. I understand last year, I think it was something crazy. It was something around like 90% of the time he was on the field, the opponent passed the ball, which tells you that he was in the third downs. He was in an obvious passing downs. But I mean, I'm sure he's never going to be a great run defender. But I don't think he's a disaster. I don't think I've seen anything that suggests he's a catastrophe as a run defender. And beyond that, it's not like Carl Lawson is a great run defender in his own right. He's in there to get after the quarterback. Now, Robert Salah values getting after the quarterback, which after years where the Jets have had coaches who have valued run defense, I'm kind of happy we're focused on the pass rush. And I think the Jets run defense last year was a little underrated. There's this perception it was very bad. I don't think there's a lot of evidence to suggest the Jets run defense was actually very bad last year. But something I'll sacrifice run defense if it gets me guys who get after the quarterback. Because you win by passing the ball in this league, and you win by shutting down the other team's passing attack. And the Jets just have a load of pass rushers right now. They have guys who can get after the quarterback. Again, their first round pick this year is not going to play a big role. Their first round pick is probably their fifth best defensive end at the moment. And he's a guy with a lot of natural ability. He's a guy who could develop into a very good player in Will McDonald. But you have four players who are better than him right now. You have Lawson, you have John Franklin Myers, and you have two guys I've been discussing, Huff and Germain. And that's what you want. I mean, the Jets for years have drafted these raw guys. Like on the 2019 Jets or the 2018 Jets, Will McDonald would have to start right away and he'd be in over his head and he'd struggle and people would be questioning him. The current Jets, you don't have to worry about that because you've got guys who can get after the passer. So you can put Will McDonald in some obvious pass rushing situations. You can let him take advantage of his natural ability and he'll probably be fairly productive because he could be a low pressure situation where he can go all out while he's in there. He can get after the quarterback. It's a good situation the Jets have put Will McDonald in. A lot of it's these guys, they keep finding these pass rushers. And I think it's a very good thing for this team. And again, one last time we saw the depth of this pass rushing group because the guy who are really at this point the third and fourth best defensive ends went out and continued to produce. And I think you're in the situation you want to because when these guys go, when your starters need a rest, you're never gonna get a bad snap. And the other thing is Carl Lawson, we haven't talked about it much. Carl Lawson's been dealing with a back injury. It's not really clear whether he's gonna be ready for week one. Not really clear how much he's gonna be able to give you the early stage of the season. It's nice to have insurance. It's nice to not be depending so much on one guy to do everything. When Lawson's hurt, the Jets still won't be able to replace him with good players. And the other aspect of this is that there's not gonna be a temptation to rush Lawson back because the defense is gonna be in good hands. So he can come along slowly. He's not gonna have to hurry himself back into the lineup before he's ready. He's not gonna have to play compromise. He's not gonna have to risk greater injury. These are the things that happen when you have good depth at the defensive end position. Now head here on the Lockdown Jets podcast. We'll close out the show. I'm gonna give credit to a guy I've been very critical of in the preseason because he had a good game. It was the night of Tim Boyle on Saturday night and I'll give him the credit he deserves continuing this Monday edition of the Lockdown Jets podcast. Today's episode of Lockdown Jets is brought to you by Game Time. Buying tickets to your favorite events should not be stressful. Game Time is the fast and easy way to buy tickets for all the sports, music, comedy and theater near you. With killer deals on last minute tickets and the best price guarantee, you can stop stressing over the tickets and start getting hyped for all the fun you'll have. As I mentioned earlier, I recently was in London and I went to an English Premier League soccer game. I caught a couple shows on the West End. Fortunately, I planned ahead so I wasn't stressed at the last minute. But that's not always the case. Sometimes you gotta get the last minute ticket and you don't wanna be stressed and that's where Game Time comes in. You can forget about planning months and events. Game Time has deals on tickets right up to the day of the event. You can get exclusive flash deals on tickets for football, basketball, baseball, concerts, comedy, theater and more. The Game Time guarantee means you will always get the best price. If you find tickets in the same section and roll for less, Game Time will credit you 110% of the difference. And you can get images of your seat before you buy so you'll know exactly what to expect when you arrive. You won't end up with an obstructed view seat. You'll have a chance to see what you're getting yourself into. Snag the tickets without the stress at Game Time. Download the Game Time app, create an account and use app code locked on NFL for $20 off your first purchase. Terms apply, again, create an account and redeem code locked on NFL for $20 off. Download Game Time today. Last minute tickets lowest price guaranteed. Everyone gets their fantasy information in the same spot. Don't follow the herd. Find the smartest pair of fantasy experts around. Vinnie Iyer and Michelle Majuk, hosts of Locked On Fantasy Football. They bring more than 20 years of NFL expertise and a unique angle to give you the moves no one else has. Locked On Fantasy Football, available on YouTube or wherever you get your podcasts. Part of the Locked On Podcast Network, your team every day. This is the Locked On Jets podcast here on this Monday, breaking down a Jets victory in the preseason, the final preseason game. Last time the Jets will take the field until they do it for real, week one against Buffalo in a couple of weeks, actually two weeks from today. The 2023 regular season starts after a long wait and long off season of anticipation. But the Jets closed things out on a positive note with a 32-24 victory over the Giants Saturday night at MetLife Stadium. And look, I'm gonna give credit to a guy I've been very critical of, and that's Tim Boyle. Tim Boyle really lit it up in the preseason finale, 9 of 11, 107 yards, a pair of touchdowns. Zach Wilson took over for Aaron Rodgers, he was decent, 11 of 18, 107 yards. So a little under six yards per attempt, but he also threw a perfect pass to Nicole Hardman, a deep ball that Hardman should have come down with. So Wilson's stats would have looked a little bit better. A solid finish to Zach Wilson's preseason, but Tim Boyle lights it up and I guess joins the likes of Jets preseason, third, fourth string quarterbacks who lighted it up in the second half of games. You can go back to Brett Ratliff in 2008, maybe Matt Sims in 2013. I don't wanna say Strevler last year because there will never be another Strevler, but maybe that second tier with Ratliff and Sims. Tim Boyle joins that group with some really nice throws. And I don't know whether Tim Boyle's job was in jeopardy as the third quarterback, but I think he went a long way towards solidifying the third quarterback role. Now, during every day, or you heard me say this last week, the Jets are probably gonna carry three quarterbacks this year because there's every reason for NFL teams to carry three quarterbacks this year. There was a rule change in the off season, and it came because of what happened to the San Francisco 49ers in the NFC championship game, because the 49ers, if you didn't see it, and I'm guessing you saw it cuz you're a football fan, but the 49ers had two quarterbacks active and they both got injured. So they ended up having to put Brock Purdy in, it was all a compromise who really couldn't do anything cuz he was playing hurt. So what the league did is they actually reinstated a rule that had existed prior to 2011, which essentially allows you to dress a quarterback who's your number three quarterback, and he does not count against your allotment of active players because you're only allowed to, of your 53 man roster, you're only allowed to activate 47 to 48 players on game day. The new rule allows you to dress a quarterback where he is technically active for the game, but he doesn't count as one of those 47 to 48 guys. So essentially, it's a free player you get to dress if you have a third quarterback. And this third quarterback essentially can only go in the game if your top two quarterbacks get hurt. So essentially, it allows you to run at least a portion of your offense. If the Jets have a third quarterback, let's say heaven forbid Aaron Rodgers and Zach Wilson get hurt in the game. Having Tim Boyle as your third quarterback, it allows you at least to do something. If you don't have Tim Boyle, you'll have to put in somebody who played quarterback in high school, like Garrett Wilson. And the difference, even though Tim Boyle is probably not gonna be great, the difference between a Tim Boyle-led offense and an offense with Garrett Wilson in the quarterback is probably pretty big. Tim Boyle's a real quarterback. So, and I've seen teams, you've seen teams win with third string quarterbacks before, and the Jets with their defense, which should be one of the five best defenses in the league, they can win games if they just get semi-functional quarterback play in some weeks. If you play against a bad opponent and you can just lean on that defense, your number three quarterback actually might be able to win you a game or two. So the Jets should keep a third quarterback. Now based on what we had seen to this point, I think it was an open question whether Boyle was gonna stay, because I don't think he had earned his spot. I think he still may have stuck around because he's got a lot of experience with Nathaniel Hackett, the old excuse, he knows the system, which backup quarterbacks somehow that earns backup quarterbacks a roster spot that he knows the system, so nobody else can learn the system. I think he's also got a relationship with Aaron Rodgers, which probably helps. But I think that Tim Boyle went a long way, if there was any jeopardy, probably went a long way towards solidifying that roster spot as the third quarterback. Again, you keep three quarterbacks now. I think NFL roster management has changed as the result of this rule. In the past, you could only activate 47 to 48 guys. You were not gonna burn one of those spots on the third quarterback. And really the only points during the season where a third quarter, where teams activated three quarterbacks were either if you had somebody who was versatile, who could play multiple positions like a taste some hill. Maybe then you'd have a third quarterback like the Saints in those days. Or the other spot was if your starting quarterback was a little banged up and you weren't totally convinced you're gonna try and start him, but you weren't totally convinced you can make it all the way through the game. You might have activated a third quarterback just as insurance in case the starting quarterback had to leave so that you wouldn't be down to your final guy. But this year the new rule change makes everything different about roster management. Having the third quarterback makes sense again. So I think Tim Boyle went a long way towards locking up that third quarterback spot in this game, made some really good throws. Now, really good throws against guys who may not be in the NFL this year. But that's what your third quarterback's gonna do in the preseason. At least he succeeded, at least he showed some aptitude in this game. Do I feel great if Tim Boyle has to go into the game for the Chets this year? Well, they're probably in a lot of trouble. But better to have somebody like Tim Boyle than have to play a wide receiver or running back at quarterback. At least Tim Boyle's a real quarterback. Anyway, that's all for today's episode. This has been the Lockdown Jets podcast, part of the Lockdown Podcast Network, your team every day's motto. As always, if you enjoy the show, hit the subscribe button where you're watching or listening so that you'll never miss an episode. If you enjoy the show and are listening on a podcast, always give it a five star review. And if you're watching on YouTube, give this episode a big thumbs up. Helps us out, helps other Jets fans find the show. Hope you have a great Monday, everybody. We'll be back tomorrow to talk more Jets. Football is back, folks. And in celebration, Lockdown presents the ultimate NFL preview show. Starting August 31st, Kanani Stevens will lead a conversation with local hosts from each team in every division across the NFL. 32 teams across seven episodes answering the need to know questions for the upcoming season. Who's the best QB in the division? What teams are most likely to make the playoffs who didn't last year? All these questions and more will be answered in the ultimate NFL preview show. Available on Lockdown NFL, on YouTube, or wherever you get your podcasts. Part of the Lockdown Podcast Network, your team every day."}, "podcast_summary": "In this episode of Locked on Jets, the host talks about the New York Jets' preseason victory over the New York Giants. Although the final score was 32-24, the host emphasizes that the final score is not as significant as what happened in the game. The main focus of the episode is on the performance of Jets' quarterback Aaron Rodgers, who made his debut in a Jets uniform. The host highlights Rodgers' performance, stating that his numbers were \"okay\" with 5 out of 8 completions, 47 yards, and a touchdown. However, the host argues that Rodgers' performance was more impressive than the numbers suggest. He analyzes a specific play in which Rodgers threw a touchdown pass to Garrett Wilson, explaining that it was originally a run play, but Rodgers and Wilson recognized a favorable matchup and adjusted the play on the fly. The host praises Rodgers' football IQ and ability to read defenses pre-snap. He emphasizes that having a quarterback of Rodgers' caliber brings a new level of excitement and potential to the Jets' offense. The host also mentions the strong performance of Jets' defensive ends Jermaine Johnson and Bryce Huff, and discusses the depth the Jets have at the defensive end position. He highlights the importance of having quality depth and how it allows the team to rotate players effectively and not rush injured players back onto the field. The host concludes the episode by giving credit to Jets' third-string quarterback Tim Boyle, who had a standout performance in the preseason finale. He acknowledges that Boyle's performance came against backups, but states that Boyle's performance solidified his spot as the team's third-string quarterback. The host also discusses the rule change that allows teams to dress a third quarterback, which plays a role in the Jets' decision to keep Boyle on the roster. Overall, the episode provides a detailed summary of the Jets' preseason finale and highlights significant performances and key points from the game.", "podcast_guest": {"name": "Aaron Rodgers", "org": "New York Jets", "title": "Quarterback", "summary": "Aaron Charles Rodgers (born December 2, 1983) is an American football quarterback for the New York Jets of the National Football League (NFL). Rodgers began his college football career at Butte College in 2002 before transferring to California, where he set several career passing records, including lowest single-season and career interception rates. He was selected in the first round of the 2005 NFL Draft by the Green Bay Packers and played for the Packers from 2005 to 2022. Rodgers is regarded amongst the greatest and most talented quarterbacks of all time.After backing up Brett Favre for the first three years of his NFL career, Rodgers became the Packers' starting quarterback in 2008. In the 2010 season, he led them to a victory in Super Bowl XLV, earning the Super Bowl MVP. He was named Associated Press Athlete of the Year in 2011, and was voted league MVP by the Associated Press for the 2011, 2014, 2020, and 2021 NFL seasons. Rodgers is the fifth player to win NFL MVP in consecutive seasons, joining Peyton Manning, Favre, Joe Montana and Jim Brown.\nRodgers has led the NFL six times in touchdown-to-interception ratio (2011, 2012, 2014, 2018, 2020, 2021); six times in lowest passing interception percentage (2009, 2014, 2018, 2019, 2020, 2021); four times in passer rating (2011, 2012, 2020, 2021); and four times in touchdown passing percentage (2011, 2012, 2020, 2021); three times in total touchdowns (2011, 2016, 2020); twice in touchdown passes (2016, 2020) and once in yards per attempt (2011) and completion percentage (2020).Rodgers is second on the NFL's all-time regular-season career passer rating list, with a regular-season career passer rating of over 100 (the first to ever have a career rating over 100) while also having had the highest passer rating, the best touchdown-to-interception ratio and the lowest passing interception percentage in NFL history throughout the entire 2010s decade.\nIn the postseason, he is second in both touchdown passes & touchdown-to-interception ratio, fourth in passing yards, and fifth in all-time passer rating. In the regular season, he has the best touchdown-to-interception ratio in NFL history at 4.52, holds the league's lowest career interception percentage at 1.4 percent and the highest single-season passer rating record of 122.5. Rodgers is also a four-time winner of the Best NFL Player ESPY Award.\nOutside of football, Rodgers has a minority ownership stake in the Milwaukee Bucks of the National Basketball Association (NBA)."}}