{"podcast_details": {"podcast_title": "Locked On Yankees - Daily Podcast On The New York Yankees", "episode_title": "Yankees are ACTUALLY playing the kids! NYY loses series in Tampa", "episode_image": "https://megaphone.imgix.net/podcasts/76e6d822-dde5-11e7-be9d-0fdbd9cd8b4f/image/uploads_2F1553800741120-ogudch2bhac-1719a7d3ab45ce7569d95e3d60d4769d_2FLocked-On-Yankees-Podcast-BG-New.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " It's the Locked On Podcast Network, your team every day. Get ready for the NFL season with incredible offers from FanDuel, America's number one sports book. Right now, new customers can bet $5 and get $200 in bonus bets guaranteed. Plus, all customers who bet $5 will get $100 off NFL Sunday ticket from YouTube and YouTube TV. This is the best time to join FanDuel. The app is easy to use and you can bet on everything from spreads to player props and more. So visit FanDuel.com slash Locked On and kick off the NFL season with an offer you won't want to miss. FanDuel, official partner of the NFL. You know how in a relationship when someone breaks your trust, it takes a while to get it back? Well, we're not back to 100% trust, but the Yankees have started repairing the damage. You are Locked On Yankees. Your daily New York Yankees podcast. Part of the Locked On Podcast Network, your team every day. Welcome to Locked On Yankees, which is part of the Locked On Podcast Network, your team every day. Thank you for making us your first Listen Every Day. I'm Stacey Gatsilias and with me as always is my producer, Steve Granado. Steve, happy Monday. Happy Monday to you, Stacey, and happy Monday to Locked On Every Dayers and everybody watching and listening today. Of course, as you guys know on this show, we've got a new series, so we've got new bullet predictions and of course a preview of this upcoming set, including tonight's game out in Detroit. It's Miners Monday, your favorite day of the week. We've got to talk about a new catching prospect, maybe not new, but maybe one that you haven't been paying attention to. A lot of Austin Wells chatter. There's another one that we need to talk about that's coming up in a little bit. First Stacey, look, trust is a tricky thing. And like we said, maybe we're not 100% there yet. We're not 100% there yet. When last week came around and the news was coming about that Oswald Peraza and Everson Pereira were getting called up, I had a little bit of PTSD flashback of Peraza getting called up. Does that mean he's going to play? And we had that same conversation when it concerned Anthony Volpe getting the opening day role, getting the call up. We're going, is Volpe going to play? They said, yes. He played and he has been playing. And I wasn't totally there yet. I was kind of, you know, boy cried wolf still when Boone said that Pereira and Peraza were going to play. Lo and behold, Stacey, they're playing. Are you, I know you said that you semi trusted or at least minimally semi trusted that that was going to happen, but are you, are you shocked to see that Peraza and Pereira are still playing? Yes, I actually am. I'm glad that they didn't lie to us this time. That's always a nice thing. Because I was really worried that it was going to be the same sort of situation that happened to Peraza last season. And so far I've been pleasantly surprised by how much they're playing everyone. It's great. Yeah. Peraza, that's eighth and plays third on Friday. That's eighth and starts it short on Saturday. Volpe got the night off and then he batted eighth and played third on Sunday. Pereira ended up batting cleanup on Sunday. He was batting seventh and playing left on Friday and Saturday, of course played left field all weekend, but Pereira batting cleanup is pretty wild. We saw as well the Cabrera only play on Sunday and then Volpe, of course got the Saturday off. He, you know, is batting sixth on Friday and then batting fifth on Sunday. Overall numbers not great for these guys. Volpe obviously did the best and went three for seven, hit a big two run, a big homer, two RBIs, two walks throughout the set, but everybody else one for 23 at that point or a three for 23, I beg your pardon. So the numbers aren't great, but we've been saying that for a while, Stacey, and I want to hold true with everything we say is, you know, you got to give these guys time to get accustomed. Yeah. And any player that goes up a level, you have to adjust and some players will do really well right away and then kind of fall off a little bit once they get into it, you know, because they kind of, sometimes you have that burst of almost like energy, like you're so energized that you made it up to a new level and you're doing all this stuff and then you kind of fall off a little bit and then you work your way back up. And then for some people, it's not easy to go from AAA to the majors. I mean, that is quite a jump in levels. So just give these kids time. I'm glad that they're letting them play and playing them as much as they are. I mean, Volpe didn't play for the first time pretty much all season. Like there were games that he didn't start, but they would put him in at some point. So I'm pretty sure Saturday was the first time he didn't play all year. So they're really sticking to their word for a change, which is very nice. And for the first time in a while, it feels like at least on some level, and I don't want to go too far down this hole, but it feels like there is some sort of direction here. They still and probably will never say that the season is over, but they are, I guess, playing I don't know how else to do it, how else to say it, but playing the way that is the case. I mean, Pereira would not be batting cleanup if the Yankees were trying to win today. You know what I mean? Like that is not the case. So letting these guys play, I mean, Oswald's numbers have not been good in the limited action he's had in the majors. Oswald Cabrera has obviously had a very down year. So I'm curious to see how they keep using Cabrera, but I mean, it is good to see Parraza Pereira getting into the lineup consistently, you know, in lieu of guys like Jake Bowers. Right. And this feels similar to 2016 when, you know, they kind of got a-rot out, brought the kids up, you had Gary Sanchez, you had Aaron Judge, you had Tyler Austin, and it was kind of like a new like, oh, the baby bombers are here, this and that. And they haven't said it in the same way as they did in 2016, but this feels better to me. This feels like, as you said, there's some sort of direction here that they're going in. And, you know, things might be a little down for the Yankees, possibly just with these kids getting into it and playing and stuff. But I like the general direction they're going in, giving these kids these roles right now and getting them used to the majors. And you know, they could be the future of the team if they don't deal them away at some point. So yeah, I mean, you got to see, you got to figure it out. It's better to figure it out now than try to figure it out next season. It's better to figure it out right now. Of course, Stacey, the Yankees did not perform well this weekend overall ended up losing two of three. Sunday's game stung a bit four and two thirds from Rodone, four hits to earn two ocks and seven strikeouts. His off speed stuff was looking pretty good on Sunday. What a bizarre series of events in the first inning. The throw from Higgy, the throw from Bader. And I'm going to jump on the soapbox really quick again, one more time. Oswald Peraza read that ball really weirdly trying to feel it to his left hand side and that throw from center. Yeah. Look, I don't know if this would have made a difference, but all I'm saying is he could have used a couple of games, a triple A at third base for that angle. Just throw that out there. Just go throw that out there. Still don't understand that. The bad read from Gleyber, that stung. That was a very, very weird ball, but very catchable at that point. You know, Higgy, DJ Volpe go deep. Nice weekend for DJ. I was going to say, let's give it up to DJ Lemayhu because he was the one bright spot the whole weekend. Like he was just hitting the whole weekend and he was looking more like 2019 DJ Lemayhu and not looking lost at the plate. That was one good thing that happened. Not one, but one of the good things that happened this weekend because there was some good in the series. It's just overall, you know, just didn't work out. There were some individual performances that were like, okay, cool. The hip batter stuff. None of them were purposeful. Like Ian, he's not trying to, Hamilton's not trying to hit someone in the head with a fastball. That's just not happening. It's just as Kevin Cash had said after the game or what did Kevin Cash say it or did Bob Lorenz say it? In the season series, the Rays had gotten hit by 12 pitches and they got hit by four this weekend. And the Yankees have only gotten hit by two the whole. So yes, the discrepancy is something, you know, I could see how maybe they're interpreting it as the Yankees just being brats because they're not doing well, but that's not it. It's just these guys are tired. The bullpen is tired and they're hitting people and they're giving up runs. And you know, this, we saw this, we saw this because if you have a bunch of starters who can't make it past the fifth or sixth inning, the bullpen is going to be tired by the end of August and you're seeing the results of that. Eight straight rubber game loss for the Yanks. They just cannot pull out a series win. That's been a tough one. Saturday, three nothing shut out. Tyler Glass now continues to wreck the Yankees. He is the Yankee killer at this point. How about this, Stacey? I pulled up some numbers for him. Glass now last five starts against the Yankees since the 2020 season. 31 innings worked, just 12 hits. Only five earned, 11 walks and 36 strikeouts. Just stupid video game numbers against the Yankees. Clark looked good. Six and two thirds got into the seventh, six hits, three runs, only one earned and five Ks. I mean, to go toe to toe with Tyler Glass now, that is no joke. Yeah. I was so proud of Clark. I was like, oh, too bad your offense can't do anything for you because that was six and two thirds. Amazing. Yeah. And then Friday game, a six, two, one, a six, two win. The only win of the weekend, of course, DJ, as we mentioned, had a nice game that night. Two homers in that one. Giancarlo with a two run double. Gleyber brings in a run with a double. And Garrett Cole, what a great bounce back. I mean, that is a massive bounce back. 11 Ks and seven and two thirds. Not only is it a good bounce back, but his numbers against the Rays weren't great coming into this throughout the season. So for him to do that against them in Tropicana Field, I almost fell over. I was like, wow, this is amazing. And thank God the offense backed him up this time because if it was another wasted start for Cole, I would have been really mad. Yeah. I mean, look, I mean, last time against Boston, right? Six earned in four innings with seven hits allowed. Like that was one of his worst starts of the year, if not his worst start of the year. So to see him do that, let alone against another AL East foe, like that's massive. That's massive. I mean, he's under three on that ERA now again. And I'm going to say it right here. We've said it a couple of times, but I'm going to flat out say it. Garrett Cole is going to win the Cy Young this year. There's no contest at this point. Yeah. He'd have to have a completely disgustingly bad September. Right. Let's not put that on to me. Well, he's not going to. He's not going to. It's Garrett Cole. Let's be real. He's going to win Cy Young. It's going to be his first and we're going to gush over it because he's incredible. I love watching this guy pitch every five days. It's awesome. Let us know how you're feeling about Paraza, Pereira playing. Obviously, we know it's not a ton of sample size so far, just a week worth of Major League Baseball so far. So let us know. Are you surprised that they're keeping to the word and actually letting them play? I want to know in the comment section down below while you're there. Of course, you can leave your questions for Fan Mail Friday. If you want to skip that line, you can join our sub text. Of course, you also get one-on-one text conversations with Stacey and myself. You get roster moves, in-game info, info, info, info, and a whole bunch of stuff. There's a free 14-day trial in the episode description. All right, guys, you already know it's Monday. So it's Miners Monday. We're going to step aside. We have a whole bunch of information to get to for you guys when we come back. This episode is brought to you by Dave. Look, we've all had times where money's been a little tight, especially these days with the price of everything going up. When it comes to those moments, Dave is there to help. Dave is the banking app that's leveling the financial playing field. So when you download Dave, you can get up to $500 in five minutes or less. There's no credit check, no late fees. It's part of Dave's extra cash account. Advance the money you need with no interest and then settle up later. Dave is available on both Android and iOS and can really help you out if you're in a pinch or if you just need a little extra cash to tie you over until your next paycheck. Download Dave today at Dave.com slash MLB. That's Dave.com slash MLB. You can get up to $500 in five minutes or less. Again, no credit check or late fees. Download the Dave app now. For terms and conditions, go to Dave.com slash legal eligibility criteria and instant transfer fees do apply. Banking services are provided by Evolve, which is a member of the FDIC. It's JD from Locked on Cardinals and Vroom is the better way to buy and sell used cars. So if you're looking for your next ride, go to vroom.com now to shop thousands of cars right from your phone. With Vroom, you never have to haggle or negotiate the price of the car so you know you're getting a good deal. And when you buy a car on Vroom, they'll deliver it straight to you. You don't have to go anywhere. You also get a full week or 250 miles, whichever comes first to make sure your new ride is right for you. Plus all cars on vroom.com come with a 90 day limited warranty and one year of nationwide roadside assistance, giving you peace of mind while you're on the road. If you're selling a car, no more posting online or dealing with buyers and their endless questions and haggling over the price. Not with Vroom. When you sell your car to Vroom, you get an instant offer in as little as two minutes and they'll come pick it up free of charge. Vroom, it's the better way to buy and sell used cars. So head over to vroom.com now to see what your current ride is worth and check out thousands of cars to find your next one. That's vroom.com. vroom.com. Back here on Locked on Yankees. And hey, don't forget Yankees versus Tigers tonight. Don't sleep on it. Detroit is playing good baseball right now. So you're going to want to listen to that on Sirius XM. Download the Sirius XM app today and to the everydayers out there. Coming up on tomorrow's show. Look, Giancarlo Stanton opened up about his season struggles. We got to dissect what he said over the weekend. That's coming up on tomorrow's show and make sure you hit subscribe so you don't miss that. And we know by the way that 70 plus percent of people who watch our videos on YouTube are not subscribed. So make sure you hit subscribe and you can be a part of that tomorrow. Join over, what are we at? Three, four, how many? 3000? Yankees fans at this point? 4,100. We're about 4,100. Oh yeah, 4,100. I'm stuck in the past. Yeah, over 4,100 Yankees fans here on YouTube. Come join us over here on the video side. All right, guys, it's Miners Monday. You already know. And I said it earlier. Everybody's talking about Austin Wells, but there's a Yankees catching prospect that you haven't been talking enough about. We're here to do it today. His name is Ben Rice. Ben Rice, the number 23 prospect in the Yankee system is going off. He's just going off right now and he has been for a while. So get this. Remember Austin Wells was called up to Scranton Wilkes-Barre on July 21st. Since then, Ben Rice has taken over the lead catching role with the Somerset Patriots, batting 325 in that span, 34 RBIs in 30 games. He's gone deep 12 times. He's 40 for 123. He is swinging it like crazy. Showed off in a big way this past week for the Patriots who are on another level right now. Ben Slam walkoff on Tuesday night in the 10th inning was a 1-0 ball game finished 4-1, crushed one down the right field line, hit a game tying homer and an eventual loss on Wednesday night. He hit a solo shot. Oh, and I didn't even mention this, Stacey, left handed. Left handed batter who can swing it. Sing to the heavens, folks. It's been great to watch that Ben Rice is filling this role. He's a guy that has kind of been in the shadow of Austin Wells. When we're talking about catching prospects, there was a little bit of news. We're actually going to talk about this more in depth later on in the week, so make sure to hit subscribe for this as well. We're going to talk a little bit about Austin Wells potentially playing some first base here moving forward throughout the season. The Yankees were talking about that. Ben Rice also plays some first base. We're going to talk about a little bit later on here in the Miners Monday segment too about another kind of utility guy. Something we like to do here on Miners Monday is point things out that you're not noticing is going on. These small little moves like, hey, look, this is a guy who plays first and catches. Hey, here's maybe the next Oswaldo Cabrera who's playing multiple positions, like that type of thing we like doing here on the show as well. It wouldn't be a Miners Monday segment if I didn't talk about Somerset pitching. There's a gun to my head if you're listening. Chase Hampton, Drew Thorpe, Richard Fitz against Hartford this week. How about this? Chase Hampton, five shutout innings, four hits, a walk, and six Ks. Drew Thorpe, again, six and a third, two hits, one run, a walk, and nine strikeouts. Richard Fitz, friend of the show, six shutout innings, five hits, two walks, four strikeouts. Combine those guys. Thirteen, scratch it, was it? Seventeen and a third innings of work. One run baseball with 19 strikeouts. Oh, to have the Somerset pitching staff in your back pocket. The Patriots, by the way, after Sundays, when have the sixth best record in minor league baseball, they are 72 and 47. It is a banner season for the Somerset Patriots. Quite literally already won the first half championship. And speaking of winning half championships, Scranton Wilkes Bay Rail Riders are coming number one right now. The Rail Riders are smoking red hot. They walked off twice this week and won six of seven against Lehigh Valley. They jump over them in the second half standings. They are 12 and four since August 11th. They have squeaked all the way to the top and are only two games back of first place. And how about this? On Saturday night, three straight bombs in the first inning. Jamie Westbrook hits a grand slam. Jake Lamb hits a solo shot. Michael Hermosillo hits a solo shot all in the first inning. The Rail Riders are playing smoking hot baseball right now. And I've already said it before. I said it last week, Stacey. Download the Bally Sports Live app because you can watch that stuff for free. And it's great if you are looking for good Yankee baseball. You have some really good opportunities right now. Watch the Patriots. Watch the Rail Riders. Rail Riders are hot. I mean, hot. And their seasons are coming to a close. So it's really exciting. I mean, I know a lot of people are talking about this AL West run right now with the Mariners and stuff. But keep an eye on the International League because there's some really good baseball being played in Scranton Wilkes-Barre right now. So definitely check that out if you can. And one more thing, Stacey. It wouldn't be a Miners Monday if I didn't talk about an unranked guy. Here we are again. Here's a prospect you have not heard of. His name is Jesus Rodriguez. He's with the Hudson Valley Renegades. He was called up for the Tarpons back on August 6th. And get this with Hudson Valley. Slashline 345-451-483. He's played 16 games, driven in 11. He has walked 10 times. And in those 16 games, Stacey, eight of those games, he's had either two or three hits. Wow. And I mentioned, hey, is this the next is Walter Cabrera? Get this. He's played four different positions. He's caught, he's played third, he's played left, and he's played first. That's impressive. Those are catch and first, okay. Third and left. Not typical positions that all kind of mix into each other unless you're really trying to go for an everyday role player kind of guy. And he spoke about it this week with the Hudson Valley media staff. And he's like, yeah, man, I just love to play. I just want to play and I want to be in the lineup wherever they put me. I will go. Sound familiar? Yeah. So I like that. I love the mentality and it's great to see him have success. He had pretty decent success as well with Tampa. So it's good to see him up and playing well with Hudson Valley. And I wanted to throw one more quick thing in here about the Hudson Valley Renegades. Ben Cowles. We don't talk about Ben Cowles. Well, maybe you don't, but we do here on this show. Franchise record, 38 game on Bay Street right now. He is just getting on base right now. He broke it over the weekend, I believe, and extended it on Sunday. So 38 game on Bay Street right now for Ben Cowles. Really cool, man. It means another great week. Another great week. Rail riders are hot. Patriots are hot. Hudson Valley's got some good guys as well. They had a tough battle this week. They're playing well, too. So it's exciting. Only a couple of weeks left of minor league baseball, which means there's only a couple of weeks left of Miners Monday. So make sure to hit subscribe so you don't miss all of the fun here on Lockdown Yankees. We're going to step aside one more time, of course, a new series with the Tigers is on deck. So we got our bold predictions when we come back. Want the chance to win more money with fewer picks? Head to Sleeper where you can win up to 100 times your money on just two or more fantasy baseball picks. Sleeper is a fantasy sports and real money gaming app focused on bringing people together through sports and gaming. Players become the fastest organically growing fantasy platform in the world with over five million active users. At Sleeper, it's not just about sports. It's about building personal connections and lasting memories. I'm StaySpace826, so connect with me over there. With Sleeper, predict the hottest baseball stats like home runs, hits, strikeouts and much more to cash in on your daily fantasy baseball skills. Entries can be made in 30 seconds or less. It's that easy. Download Sleeper in your app store and use promo code LOCKDOWN and you'll get up to a $100 match on your first deposit. Terms and conditions apply and you can see Sleeper's terms of use for details. It's currently operational in over 30 states, so check out Sleeper today. NFL Sunday Ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan, even if you live far away. Like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out of market team is never more than a short distance away, specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. Offer ends $9.19. No refund. Subscription auto renews. Back now on Locked on Yankees, the Yankees head to the Motor City tonight, Comerica Park. See Miggie one last time. Of course, you can catch it all on Sirius XM. Download the Sirius XM app today and listen to John and Susan Stace Monday night. Seve, are you buying after his solid outing last time out? I'm feeling better going into this, but I need to see more than one solid outing. I'm cautiously sort of optimistic. I won't say I'm totally optimistic, but there's a little part of me that- You couldn't find a lesser word than optimistic. You were searching for one in your head. Yeah, I was. My ADHD brain is like, nope, I'm not giving you a word. Just optimistic. Hey, I like it. I like it. Reese Olson takes the ball. He has made like 15 appearances this season for the Tigers. The Yankees have not seen him. He's been a little bit out of the pen, mostly as a starter. He's pitching roughly lately. He's had a couple of little stretches thus far for the Tigers. Strikeouts are still in good ranges so far. The Yankees tend to strike out a lot, so keep your eye on the strikeouts tonight. That's going to be a bit of an issue if we're just looking off of the recent numbers for Reese Olson, but he has been hit around. He's not unsuceptable. Now I can't find a word to that. Michael King taking the ball on Tuesday, Stace, against Tariq Schubel. King, starter, two times in a row. Is this a thing? I think it is. I think they'll stretch him out a little more. If he does okay, I would assume maybe three, or if he pitches efficiently, maybe four? Maybe. It depends on the pitch count, I would think. It just depends on how he does. That's what they really worry about with him, especially because of the injury history and stuff like that. It's been a while since he's really truly started, every five days going out there. We'll see how that plays out. Cole pitches on Wednesday again. It'll be his last start of August, which has been a very strong month for him. They haven't named starters for Detroit just yet as of this recording for Wednesday and Thursday. Clark Schmidt takes the ball. He's coming off of obviously, we just mentioned, a really, really good one against the Rays. I don't think this series against Detroit is out of the realm of possibility to take at least two of four here. We'll obviously have to see how Wednesday and Thursday line up, but are you feeling at least... They ran with Tampa save the Glass now outing, right? They ran with them. Yeah. I'm feeling a little better coming into this one. I just don't like that it's a four game series, but we're going to do... Yeah, I'm feeling a little better about it because as you said, Sunday's game was winnable. A lot of dumb things happened. It's just the way the season's going for the Yankees. Yeah, we'll see how it goes. Need I remind you, Stacey, that the Tigers are playing good baseball? Sound a little Nationals-y. Yeah. Heading into that series, they're going, uh-oh, a team is starting to surge. Watch out for Spencer Torkelson right now. He's on fire. Watch out for a guy that I watched last season in the international league, and the second I saw him, I went, uh-oh, this guy is going to be trouble. Kerry Carpenter, this dude... I think this is a problem. I tune into Tigers games every now and then. My girlfriend's from Detroit, so I'll watch a little bit of Tigers baseball every now and then. Obviously, they're in American League, so I see them every now and then. Every time I flip on a Tigers game, Kerry Carpenter does something. Maybe I need to not watch any of these four games because if Kerry Carpenter does stuff in this series, you could put that on me. But Kerry Carpenter's going to Kerry Carpenter... Not Tariq Scoobel. Spencer Torkelson's going to Spencer Torkelson, and again, this will be the last time we see Miggie, which is cool. But all in all, Stacey, need I remind you this? You do currently hold a two-point lead in the Bold Predictions scoreboard. You lead four to two over me. Stacey, do you have Bold Predictions for the series in Detroit? Yeah, he's win three out of four. Woo! I like that. I like that. Do we keep this track of Stacey's positive, I'm negative? Do we keep being in Yangy-ness? I don't know why I said that, but I was like, that's pretty bold because with the way they've been playing and not winning any series lately, that's really bold to even think that they're going to win more than two in this series. I'm going to stick on the negative side because it worked out well for the Yankees last time. I said they're going to get shut on two games. They never got shut on that series. That's true. They just didn't win it. Kerry Carpenter goes deep twice, drives in minimum five in the four game series. And everyone's going, who's Kerry Carpenter, Steve? Who are you talking about? I'm telling you, man. I'm telling you, man. Of course, now that I say that, Kerry Carpenter goes over 12. Everyone will be thanking you at the end of the series if that happens. I like these bold predictions from Steve. They're working out great for us. Kerry Carpenter, two bombs, at least five driven in the series, four game set. We'll see. Don't forget, to the Everydares, Tuesday, Gene Carlos Stanton talked about his season, opened up a little bit, gave us a peek inside his brain. We're going to talk about that on tomorrow's show, so make sure to hit subscribe. And that's going to do it for today's Lockdown Yankees. I'm Steve Granato. And I'm Stacey Gatsulias. We'll see you tomorrow. The MLB regular season is coming to a close, but the excitement is just getting started. For all your MLB pennant race needs, join your baseball buddy, Stully, as he brings you all the insights you need for the September playoff push on Lockdown MLB. Who will finish at the top and who will just miss out on the last spot? Find out all this and more on Lockdown MLB, available on YouTube and wherever you get your podcasts. Part of the Lockdown Podcast Network, your team every day."}, "podcast_summary": "In this episode of the Locked On Yankees podcast, hosts Stacey Gotsoulias and Steve Granado discuss the recent performances of Yankees prospects Oswald Peraza and Everson Pereira, who have been playing consistently since their call-ups to the major leagues. They analyze their playing time and performance so far, highlighting the importance of giving them time to adjust to the major league level. They also discuss the Yankees' recent series against the White Sox, in which they lost two out of three games. They mention some standout individual performances, such as DJ LeMahieu's strong hitting and Garrett Cole's bounce-back performance. They talk about the Yankees' struggles in rubber game situations and the team's overall direction. The hosts then move on to the minor leagues and focus on catching prospect Ben Rice, who has been having a strong season with the Somerset Patriots. They also discuss the recent performances of pitchers Chase Hampton, Drew Thorpe, and Richard Fitz, who have been impressive for their respective teams. The hosts also mention unranked prospect Jesus Rodriguez, who has been playing well for the Hudson Valley Renegades, and they give a shout-out to Ben Cowles for his franchise record 38-game on-base streak for the Renegades. Finally, they preview the Yankees' upcoming series against the Detroit Tigers and make bold predictions for the series. Stacey predicts that the Yankees will win three out of four games, while Steve predicts that Tigers player Kerry Carpenter will hit two home runs and drive in at least five runs in the series. The episode concludes with a teaser for the next episode, in which the hosts will discuss Giancarlo Stanton's recent comments about his struggles this season.", "podcast_guest": {"name": "Stacey Gatsulias", "org": "Locked On Podcast Network", "title": "Podcast Host", "summary": "Not Available"}}