{"podcast_details": {"podcast_title": "Locked On Mets - Daily Podcast On The New York Mets", "episode_title": "Why You Shouldn't Believe All the Pete Alonso Trade Rumors?", "episode_image": "https://megaphone.imgix.net/podcasts/6989f14e-4b28-11e9-831a-9b8625db22a6/image/uploads_2F1553097247021-ph3t1txuzwa-2114e21569114113517b5aef84852962_2FLocked-On-Mets-Podcast-BG.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " It's the Locked On Podcast Network, your team every day. Will the New York Mets actually trade Pinalonzo this winter? We'll discuss all the latest rumors on today's edition, Locked On Mets. You are Locked On Mets, your daily New York Mets podcast. Part of the Locked On Podcast Network, your team every day. Hello to all you amazing Mets fans. You're listening to Locked On Mets, part of the Locked On Podcast Network, your team every day. Thank you for making Locked On Mets your first listen every day. Locked On Mets is free and available on all platforms including YouTube. On the show today, we're going to discuss the latest reports around Pinalonzo as they keep on trying to put this man in trade rumors. First segment I'll go through some of the latest reports and how I feel about them. In the second segment, I'll touch on what I think is going to happen here between the Mets and Pinalonzo. Then in the final segment, we'll recap some baseball from the weekend as the Angels and Shohei Otani came through city field. Before we get to any of it though, I'm your host Ryan Finkelstein. If you want to find any of my work, follow me on Twitter at FinkelsteinRyan. You can also find some of my writing at JustBaseball.com where I work as the managing editor. To all you reporters and news outlets out there, do me a favor. Keep Pinalonzo's name out of your mouth and out of your headlines. I am so sick of seeing Pinalonzo trade talk. At the end of August, the deadline passed. The Mets can't trade him right now. And nothing I have read gives me any indication that the Mets are any more willing than you would have imagined to move him in the winter. Could there be some smoke here in a couple of months? I can't say for certainty that there won't be any. But I still strongly doubt it. And this most recent report by Bob Nightingale is absolutely ridiculous. And it's just trying to cause panic and havoc and get people to click on articles. Because what Bob Nightingale basically says is the Mets expected to trade Pinalonzo. But if you look into his story, you see that that reporting is pretty flimsy. But I want to back up a little bit because the Pinalonzo trade stuff really started to get a new life of its own after the deadline when Ken Rosenthal wrote a story about it last Tuesday. Now if you read his story, it is well-sourced, it seems. And it's pretty fair. Now a big part of that piece that got circulated that made everyone go crazy was the part where it says the Brewers thought they had a trade in field goal range. But if you look back at that article right below it, it says a Mets official disputed the characterization that a deal with the Brewers was within reach, saying conversations never accelerated to that level. Other teams included the Cubs that were interested. But from a Mets perspective, no deal was ever close. So that's what the Mets are saying. And the Brewers are saying or were saying that a deal was in field goal range. Well, is that a former extra point? Is that a nice 26-yard field goal? Is that further back? Are we talking a 54-yarder? Is this a Justin Tucker type field goal? That's it. It's a pretty wide range that a field goal can mean. And honestly, what exactly does that mean? That story, which if you go back, it was titled Pinalonzo with Center of Trade Talks with Brewers. It says the Brewers are interested. Okay. Will the Mets make a move this off season? Again, that's some fair reporting. But when you read the story, all it basically says is that the Brewers were interested, the Cubs were interested, the Brewers felt like they were close to deal, the Mets never felt like they were close to a deal. There you go. Maybe the Brewers were surprised at how willing the Mets were to talk about it. But the Mets set a lofty asking price that the Brewers clearly never got close to reaching. That was, to me, ended story there. Now, the latest one from Bob Nightingale reported that it's expected that the Mets will trade the first baseman this off season. In the article, he writes All-Star First Baseman Pinalonzo is expected to be traded by the New York Mets this winter. Several executives insist after conversation with the Mets. Okay. So first of all, with conversation with the Mets, that means that those executives aren't part of the Mets organization. He also talks about how Alonzo is not under contract beyond 2024 and that the Mets have informed teams that anyone who isn't under contract at the 2024 will be available and they have not come close to reaching a contract extension with Alonzo in past years. So all that information that he is reporting is stuff that was out there at the deadline and now he's regurgitating it three weeks later, four weeks later at this point. As if it's news, yes, at the deadline, the Mets were interested or were not interested. They were all years on any player who was not under contract beyond 2024 and they traded a lot of them. Who did they not trade? Pinalonzo and Jose Quintana. Those are the two. Does that mean that the Mets, when they go into this winter, are going to think again about selling? Do you think Steve Cohen is going to watch the Mets maybe finish in last place because the Nationals are better than them right now? He's going to be happy to say, yeah, you know what, let's take this team that sucked. Let's trade Pinalonzo and Jose Quintana. Let's have Kodai Sanga on an island with David Peterson, Tyler McGill and Joey Lucchese and Mike Vassal. Let's not address the rotation. Let's not address the bullpen. And I'm excited to sell to my season ticket holders that we're going to have Francisco Lindoor, Brandon Nemo and Edwin Diaz out there. And we're not going to do anything to help those guys. I'm already paying a bunch of money to, and we're just going to suck in 2024. Do you really believe that's the Mets plan of attack this year? If the Mets were to entertain a Pinalonzo trade, in my opinion, it happens at the deadline because they were so bad again next season that they are once again in that mode where they're selling to rebuild. I don't know if they're so all in on the sell that they're like, all right, let's move Alonzo. The only thing that would make you willing to move Alonzo is if you think you have someone ready to take over. And what has Mark Vianto showed us so far that makes you think he's ready to be the starting first base for the New York Mets. One more from Bob Nightingale here. Quote, the fact that they had every opportunity to sign this guy and didn't speaks volumes about his future. One nationally managed, one nationally general manager told Nightingale, could that have maybe been Matt Arnold from the Brewers? Could that maybe be a Brewers franchise that is a little bit fresher with the New York Mets who have been widely rumored to poach their top executive David Sterns? And they're trying to cause a bunch of conflict with the Mets. Maybe not the best player, but maybe the most marketable and the biggest fan favorite player. To me, all of this is a whole lot of nothing. It doesn't mean that Pete Alonzo is definitely a forever Met, but I certainly don't think that the Mets front office on August 28th is sitting here thinking, man, we can't wait to resume those Pete Alonzo trade talks we had at the deadline. I just don't see it. I think that they were listening on everybody and they set a ridiculous bar to meet to trade Pete Alonzo and no one met that bar. And hey, maybe they set the same absurd bar again this off season, but why is the team going to trade their best overall prospect and three other prospects or whatever ridiculous bar the Mets set for one year of Pete Alonzo? Is that trade going to happen? I'll go into a little bit more why I still don't believe it's going to happen and where I think this goes next. But before we get into any of that, today's episode is brought to you by Dave. Dave is the banking app that's leveling the financial playing field. When you download Dave, you can get up to $500 in five minutes or less. No credit check, no late fees. It's part of Dave's extra cash account. Advance the money you need with no interest and then settle up later. Extra cash gives you more money to buy groceries, fill your tank and finally get your car repaired or catch up on bills without having to wait for your next paycheck. You can even build credit when you settle up on time. Hundreds of people have already downloaded the Dave app to make their finances easier. So if you're in a pinch, get the help you need by downloading Dave. Download Dave today at Dave.com slash MLB. That's Dave.com slash MLB. You can get up to $500 in five minutes or less. No credit check, no late fees. Download Dave app now or go to Dave.com slash MLB. For terms and conditions, go to Dave.com slash legal eligibility criteria and instant transfer fees apply, making services provided by Evolve member FDIC. It's JD from Locked on Cardinals and Vroom is the better way to buy and sell used cars. So if you're looking for your next ride, go to Vroom.com now to shop thousands of cars right from your phone. With Vroom, you never have to haggle or negotiate the price of the car so you know you're getting a good deal. And when you buy a car on Vroom, they'll deliver it straight to you. You don't have to go anywhere. You also get a full week or 250 miles, whichever comes first to make sure your new ride is right for you. Plus, all cars on Vroom.com come with a 90-day limited warranty and one year of nationwide roadside assistance, giving you peace of mind while you're on the road. If you're selling a car, no more posting online or dealing with buyers and their endless questions and haggling over the price. Not with Vroom. When you sell your car to Vroom, you get an instant offer in as little as two minutes. And they'll come pick it up free of charge. Vroom, it's the better way to buy and sell used cars. So head over to Vroom.com now to see what your current ride is worth and check out thousands of cars to find your next one. That's Vroom.com. Vroom.com. The New York Mets play the Texas Rangers at 710 Eastern Time tonight. Get your every pitch in the Mets hometown broadcast with SiriusXM on the SXM app. And when it comes to these Pedalanzo trade rumors, I already explained why I don't believe they're viable because I honestly don't think the Mets are going in the tank again next season. Take Max Scherzer's words with a grain of salt. I just don't imagine a Steve Cohen led franchise looking at a blank slate of a season when you still have Kodai Sanga that you're paying money that you have only for maybe three years of control because you could opt that after that third year. You're paying Francisco Lindo or $34.1 million. Brandon Nemo, Edwin Diaz, all of these guys in the prime of their careers. Jeff McNeil on an extension. In a team that, while it looks awful right now, might not be that far away. Add a couple of starting pitchers, round out that bullpen, hope that some of the kids come up and help out your position, player core. Maybe you make one key signing there. You get one extra bat that you're really liking for agency to plug into left field or something like that. And hey, maybe you're off to the races. You know, Stali Marte, paying him a lot of money. And at this point, I imagine he shut down for the season. You rest him up, maybe a long off season for him. He comes back to normal next year. This team could still be good. But if you remove Peter Lanzer from the equation, it's going to be that there's, there's no batting free agency that could replace Peter Lanzer. It's just not there. Now next year, the 2025 Juan Soto could be a free agent. Could you be leaving first base open because the Mets want to sign Juan Soto and make him a first baseman? Potentially, potentially, but you got to be real sure that the Padres aren't going to ruin those plans by just extending them. You got to be real sure that you're going to get Juan Soto when he hits free agency and be willing to gamble the Alonzo relationship. A guy who bleeds your colors clearly has said it time and again, does great charity work in New York City, has done everything right in his career. And based on the home runs he's hit, he's on a hall of fame track. What does that mean to a Mets organization that only has two hall of famers that saw the end of David Wright's career and how that didn't pan out and just watched Jacob DeGrom go to another team and who knows when the next hall of famer comes around for the Mets? Do they want to trade a guy that not only is on that track, but has proven that, hey, even in a down season, he's got 39 home runs. I think Peter Alonzo brings more value to the Mets than he would do to a lot of teams, quite honestly. He's the perfect fit. So why move him? Because the trade package you get back is that good? Potentially. And so if the Mets set a ridiculous bar and they keep the phone lines open, hey, maybe there's a team that ponies up. But how many teams go into the season and are ready to mortgage their farm on a trade? That desperation comes at the deadline, which is where, again, I say if Alonzo's traded because the Mets suck again next season and at the deadline, they're sellers again and they're moving their rentals, Alonzo's a rental. That's where it can happen. And you know what? Hey, maybe the relationship isn't severed enough for you could resign them in free agency. I don't know. Here's another part of it. Alonzo is represented by Apex, Apex, a relatively new sports agency. Alonzo is their biggest guy. He's their biggest name guy. It's him or Will Smith, the catcher of the Dodgers. Mitch Henniger is the third guy that's listed on the site prominently. And he did make it to free agency. He signed a three year, $43.5 million deal with the Giants. Will Smith has not been extended. He's got two years of arbitration left, Alonzo one year. If there has been serious contract talk in previous off seasons, maybe Alonzo's representation made it pretty clear he wants to get to free agency. And for a sports agency like Apex, having Alonzo hit free agency and get the biggest possible offer makes a lot of sense for them. And you know, I'm sure they're even telling him, look, we're going to get you more money. You have put up solid numbers all the way through. Stay the course, stay the course, stay the course. So now Alonzo's name has been in trade rumors a ton. I imagine after the season, Alonzo is going to meet with representatives again and talk about the course of action. Hey, you got, you know, this last year contract year, all the stuff you have to prepare for. Could Alonzo go to them and say, hey, I'm sick of these rumors and I want to stay with the Mets. There is a world where these trade rumors end up working on the Mets favor and Alonzo's representation show up to them more eager than they've ever been before to get a deal done. And in that circumstance, I would hope that the Mets will give him everything he wants. I'm not saying, hey, just give him a blank check. But what I mean is, hey, give him the full no trade clause, let him feel protected. Give him the incentives for home runs or for awards or all of it. And then get him to sign a contract that has a healthy base that's not going to kill you when it comes to average annual value on the luxury tax. And maybe they can come to terms on extension or let next season play out. Maybe you are unsure. Maybe you are excited or not excited, but you are intrigued by the possibility of moving Alonzo like some of these reports say. I don't think that the value to get back for him is much different if you trade him in the off season than if you trade him at the deadline. So let it play out a little bit. See what your ball club is. Because if you're at the trade deadline and suddenly Luis and Helacuña and Drew Gilbert have both found their way on the big league roster and performing and hey, Brett Beatty is a new man that year. And all of a sudden, maybe Ronan Maricio and Mark Fientos has figured it out. Now you've got a young core and you're actually winning games and you're in the hunt. Hey, you're a buyer. Maybe the other direction happens. For whatever reason, your pitching is terrible. You have a young core. You want to add to it more and it's your last chance to move Alonzo and you do it. I just think that the idea that the Mets are moving him this winter because they were listening at the deadline sounds to me like some executives for other teams that might have some sour grapes about the New York Mets and want them to be uncomfortable right now when they already are because the team is bad. That's what it feels like to me. And a reporter like Bob Nightingale is more than happy to be a grief eater and send that stuff out there and try to stir up some paranoia so Mets fans are frantically clicking on his article and liking his tweet and retweeting it and giving him that attention that he wants, which is his job, mind you. But still, that's where I'm at with it. Don't buy into these Pete Alonzo trade rumors. If we actually hear in the winter that the Mets are seriously considering moving him, then you can panic. But for now, be calm, be patient. I bet you that Pete Alonzo stays put and either gets a contract extension this off season or ends up coming back to the Mets and free agency or if he doesn't, it's because the Mets signed Juan Soto to replace him. That's the more likely scenarios I think that, oh, Pete Alonzo gets traded to the Brewers this off season. I bet you that never happens considering all the stuff that's come out lately and I strongly doubt the Mets are willing to entertain any trade offers from that specific team anymore. But I spent enough time on this. Shoyotani played baseball at City Field this weekend and I want to discuss it. We will in a second. Before we do though, today's episode is brought to you by Sleeper. Want the chance to win more money with less picks? Head to Sleeper where you can win up to 100 times your money on just two or more fantasy baseball picks. Sleeper is now offering up to 100 times payout for up to 8 pick contests where you can choose as many as 8 players that you like and pick more or less on your favorite baseball stats like home runs, strikeouts, hits and more. Get your picks right and you can win big. There's built in group chat functionality where you can see and copy your group's picks with the tap of a button. Entries can be made in 30 seconds or less. It's that easy and they're safe and fast with draws. Use promo code LOCKDOWN and you'll get up to a $100 match on your first deposit. Terms and conditions apply. See Sleeper's terms of use for details. Crowning operational in over three states. Check out Sleeper today. Terms and embargoes apply. Offer ends $9.19. No refund. Subscription auto renews. The New Yorker Mets put the Texas Rangers at 710 Eastern Time tonight. Catch every pitch in the Mets hometown broadcast with SiriusXM on the SXM app. Just search Mets. Well, we finally got the matchup we were all waiting for. Kodai Sanga vs. Shoei Otani Friday Night Baseball. Kodai Sanga ghost fork giveaway swept through the stadium and there was all the anticipation in the world for that matchup. And honestly, a little bit boring. He walked him twice. Otani walked three times on Friday night. He went one for two at the double. Did hit that double off of Sanga. Kodai Sanga knew what he was dealing with, stayed away from him, but I will say the excitement for Shoei Otani is just remarkable. It's everywhere he goes, but particularly a big market where the ballpark can be packed that way. This guy is one of a kind. Not because he's a hitter and a pitcher, because he's the best athlete in this sport and the ball just sounds different off his bat and everyone has their phone out just to get a glimpse of him. That whole thing is actually funny. Side note, I think it's ridiculous to take pictures of players at games. I honestly do, because I'll tell you what, you can Google Shoei Otani and find yourself a way better picture than the one you're going to get 300 feet away from them on your phone camera. Watch with your eyes, not your phone cameras, people. Sorry, it's just my own little pet peeve. But Shoei Otani is remarkable to watch and it's crazy as a D.H. He just strolls up to the plate a couple times a game and that is where your eyes glued to the screen. I'm sure if you're in the ballpark, you're just waiting to see him do something, because every time he steps up, you think he's going to do something. He had two really good games. He went two for three on Saturday with a double, a triple, two walks. The guy who had his number was David Peterson. That's the funny thing to me. Where did that come from? That was the David Peterson that has me looking so stupid this year, because the way he pitched on Sunday is what I saw last year, what I saw in spring training is the guy that I thought could be a number three in the big leagues. David Peterson was lights out. Didn't give up a run until the seventh inning. He struck out eight, three hits allowed, three walks, attacked all day. Where was that? All year long, I've been waiting to see it. Awesome to see. Cody Sengal, also I should mention on Friday, he pitched great, six and two thirds, allowed two runs, struck out 10. Another outstanding performance by him. The Mets only scored one run for him though. Francisco Andor hit a home run. That was it. Carlos Carrasco was awful on Saturday. Might be his last start in the Mets uniform, probably should be. I'd hope that the Mets just DFA him. Or give him that nice nod of, oh, Carlos Carrasco has a elbow soreness. We're putting them all in the IL and you just quietly just fade them off, have them exit stage right and you don't have to see him again. He looks washed. He does. It's rough to see a guy who had a really good career, just look like this, but he's got nothing left. He got five runs on seven hits. Didn't make it out of the second inning, was boot off the field. And the Mets bullpen to show you how the angels really aren't that good. The Mets bullpen with your collection of Sean Reed Foley's and everything else, whatever who even cares, you pitch bottom line, their bullpen put up zeros from the third inning on in that game, but the Mets only scored three runs. So Carlos Carrasco lost it. Five three Mets lose. Yeah. Carrasco at this point. Let's see Mike Vassal up here and see what he can do or rather see Jose Budo even. But I digress on that. Finally on Sunday, as I said, David Peterson was awesome. The Mets didn't score a lot. Okay. Francisco Alvarez had an RBI single in the fourth inning, which was the only run the Mets scored until the bottom of the eighth. You know, Peterson was pitching with a one-nothing lead for most of the game. He gives up a run in the top of the seventh. Then Drew Smith comes on and immediately gives up a home run. So the Mets are suddenly losing. But Pete Alonso had an RBI double in the bottom half of that inning. And then in the ninth, Francisco Alvarez is hit by a pitch. DJ Stewart got a base hit. Mark Vientos drew a walk below the bases and Rafael Ortega walked it off. And I don't know if you all feel this way, but I feel like if your team is just an awful watch and has no chance of making the playoffs and is way out of it, and it's just kind of an embarrassment day in, day out, you shouldn't even celebrate walk-offs. You should walk it off and walk off the field. Like just to see Rafael Ortega and Jonathan Arauz and Danny Mendick jumping up and down, it does nothing for me. It just doesn't. It's just sad, man. It's sad. The walk-offs when your team is this bad. It's just, it's not, it's not any fun. I mean, it's good the Mets win and, you know, I'm not sitting there rooting against the Mets when the bases are loaded. But I still don't have that exuberance in me to be like, yeah, let's dump gum and water on Rafael Ortega. But hey, it is what it is. Let's actually take a look. Since I just brought up, I'm not rooting for the Mets to lose, let's take one look at the lottery right now. Cause hey, in some respects you should be rooting for the Mets to lose. Where are we at? Looking at these odds, you got Oakland still hanging on to first, Kansas City second, Colorado third. Those teams probably won't be touched. White Sox fourth, again, probably not touched. Mets are four games back of the Cardinals at this point and two back of the Pirates for the sixth slot. So tough road to hoe there. I think the best bet for the Mets is battling out the Tigers. Yeah, they're sitting in eighth. And the funny thing is the Nationals are now, you know, sending a game better than the Mets, you know, as far as the actual standings and game back when it comes to the tank. And that doesn't matter because they're not going to win the lottery anyway. So if the Nationals won it actually would have helped the Mets because they had to forfeit a top six pick because they're a revenue earning team. Like they get money in the ref share and they won the lottery last year, which means they can't win it this year. But interesting enough. So Mets, Padres, Guardians, all these teams that makes the Yankees aren't that far back from the Mets in the tank. Just something that we'll continue to monitor as we close out this season. But hey, Mets Rangers got a chance to play spoiler on Max Scherzer this week. It'll be fun to watch. I'll be covering it, of course. So make sure you are subscribed wherever you get your podcasts. Subscribe on YouTube. Follow me, Finklestein Ryan. Follow the show at Locked on Mets. Thank you for making Locked on Mets. And first listen every day. If you want to catch every pitch of the Mets hometown broadcast this week, you can do so with SiriusXM on the SXM app. Just search Mets. The MLB regular season is coming to a close, but the excitement is just getting started. For all your MLB pennant race needs, join your baseball buddy, Sully, as he brings you all the insights you need for the September playoff push on Locked on MLB. Who will finish at the top and who will just miss out on the last spot? Find out all this and more on Locked on MLB, available on YouTube and wherever you get your podcasts. Part of the Locked on Podcast Network, your team every day."}, "podcast_summary": "In this episode of the Locked On Mets podcast, host Ryan Finkelstein discusses the latest trade rumors surrounding New York Mets first baseman Pete Alonso. Finkelstein expresses his frustration with the constant trade talk surrounding Alonso and emphasizes that the Mets cannot trade him at the moment since the deadline has already passed. He doubts that the Mets are seriously considering trading Alonso in the winter, despite recent reports suggesting otherwise. Finkelstein analyzes various reports by journalists and questions the validity of their sources. He argues that the Mets are unlikely to trade Alonso because they are not in a position to rebuild and they do not have a suitable replacement for him. Additionally, Finkelstein suggests that Alonso's representation may prefer him to hit free agency in order to maximize his value and potentially secure a larger contract. Finkelstein concludes by stating that he believes Alonso will either sign a contract extension with the Mets or return to the team in free agency if he does not sign an extension. Finally, Finkelstein briefly recaps the recent series between the Mets and the Los Angeles Angels, highlighting standout performances by Shohei Otani and David Peterson. He also mentions the ongoing race for the top pick in the MLB draft and notes that the Mets are currently several games back from the top three spots. Finkelstein reminds listeners to subscribe to the podcast and follow him on Twitter for more coverage of the Mets. Overall, this episode provides a detailed overview of the current trade rumors surrounding Pete Alonso, while also touching on recent Mets games and the team's position in the tanking race.", "podcast_guest": {"name": "Pete Alonso", "org": "", "title": "", "summary": "Peter Morgan Alonso (born December 7, 1994), nicknamed \"Polar Bear\", is an American professional baseball first baseman for the New York Mets of Major League Baseball (MLB). He made his MLB debut during the 2019 season.\nAlonso played college baseball for the Florida Gators before the Mets selected him in the 2016 MLB draft. Alonso made his MLB debut on Opening Day in 2019 and won the National League's Rookie of the Year Award that year, setting a major league record for rookies with 53 home runs. He is a three-time MLB All-Star and he led the league in home runs in 2019 and in runs batted in in 2022."}}