{"podcast_details": {"podcast_title": "Locked On Mets - Daily Podcast On The New York Mets", "episode_title": "Who Are the Top Five Prospects in the Mets Farm System?", "episode_image": "https://megaphone.imgix.net/podcasts/6989f14e-4b28-11e9-831a-9b8625db22a6/image/uploads_2F1553097247021-ph3t1txuzwa-2114e21569114113517b5aef84852962_2FLocked-On-Mets-Podcast-BG.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " It's the locked on podcast network, your team every day. This is David Harrison of the locked on commander's podcast here to tell you that us cellular knows how important your kids relationship with technology is. And they've made it their mission to help them establish good digital habits early on. That's why they've partnered with screen sanity, a nonprofit dedicated to helping kids navigate the digital landscape and for a smarter start to the school year, us cellular is also offering a free basic phone on new eligible lines, providing an alternative to a smartphone for children, start smarter with us cellular, visit us cellular.com slash built for us to find out more terms apply. Who are the top five prospects in the Mets farm system right now? We'll discuss that on today's edition. Blocked on mats. You are locked on Mets. Your daily New York Mets podcast, part of the locked on podcast network, your team every day. Hello to all you, uh, maize and Mets fans. You're listening to locked on Mets part of the locked on podcast network, your team every day. Thank you for making locked on match. Our first listen every day locked on Mets is free and available on all platforms, including YouTube on the show today, we're going to break down my top five prospects in the Mets system in the first segment, we'll be breaking down the top two second segment numbers three and four. Then the final segment we'll get to number five and I will recap the Mets victory over Adam Wainwright in the St. Louis Cardinals on Thursday night. Before we get to any of that though, I'm Hercules Ryan Finkelstein. If you want to find any of my work, follow me on Twitter at Finkelstein Ryan. I also had some, I writing at just baseball.com where I work as the managing editor. Swing for the fences on sleeper picks and you can win up to a hundred times your money. Download sleeper app, use promo code locked on. It'll get up to a hundred dollar match on your first deposit. Terms and conditions apply. See sleepers terms of use for details currently operational in over 30 states. Check out sleeper today. Well, on yesterday's show, I alluded to the fact that today's podcast would be about it updated top 10 list, who are the top 10 prospects in the Mets farm system. Pouring over it all today. I decided to be best to split this up and do a top five this week and then look at the bottom five, maybe even extended out a bit next week, because I think the top five names in this farm system bear a lot of thought when you look at the future of the franchise, because I really think there's a group at the top of this list that will have a very big impact on. The Mets trying to be a team that could one day compete with a franchise that has already developed and brought that level of talent up to the big leagues who has owned this division. Of course, I'm talking about the Atlanta Braves. The Mets have since Steve Cohen came in, wanted to put an emphasis on the farm system. And luckily, there's been one crown jewel that has made his debut this year and has already proven to be a player with real staying power at the big league level. And that is Francisco Alvarez. You hope that somebody from that class of Brett Beatty, Mark Fiantos and Ronnie Mauricio can join him. And then now there's these next waves that are coming through. Right now we're seeing everybody update their top 100. It's what all these different outlets do after the trade deadline when prospects are moved and when you have a large portion of the minor league season to look at. And then typically over the winter, when they get closer and closer to spring training, all these lists will be updated again as the new top 100 heading into 2024. So this is the time for the mid season updates. And I just wanted to rattle off some of the clear, clear highlights that we've seen in the mid season. We've seen some of the clear top prospects in the med system based on the consensus in top 100. So we'll start with the MLB pipeline. Luis and Hella Cunha they have at 40. They have Drew Gilbert at 57. They had Jett Williams at 84. They have Ronnie Mauricio at 93. And then they have Kevin Perata at 96. Baseball America's updated top 100 has Luis and Hella Cunha at 63, Drew Gilbert at 64, and Jett Williams at 97. Just baseball, where I work, we just had our own top 100 come out. And right now it's Luis and Hella Cunha at 49, Drew Gilbert at 87, and Ronnie Mauricio at 99. Finally, Kyle McDaniels of ESPN ranked the top 50 and he had Jett Williams at 45, Gilbert at 46, and then he referenced Acuna and Mauricio as other players of note. So you hear a lot of these names repeat themselves and those are the names we're going to talk about on today's show. But the guy that was atop most of those lists and is, I'd say getting close to me, a consensus top 50 prospect in baseball. Baseball America has him in the 60 range, but he's getting very close to being in that even further upper echelon is Luis and Hella Cunha. And to me, he is the top prospect in the med system. Of course, the meds just acquired him in the max charters of trade and that was a one for one. One prospect for a future hall of famer. Not a trade that we've seen often, might not be a trade we'll ever see again, although the meds executed that exact type of trade twice at this deadline. Acuna, of course, the name is the first thing that grabs your attention. Ronald Acuna Jr., his older brother, is likely to win the MVP this year. He has stolen 55 bases. He's hitting over 330, has a chance to get up to 40 home runs if he really pushed it, more likely like 35. But he's had an unbelievable season on the best team in the National League. And everyone sees his little brother and sees a very similar swing and thinks, oh, wow, what's he going to be? One thing I want to do now is make sure you understand that Luis and Hella Cunha is not expected to be his brother. If anything, I think most people have comped him more to his brother's teammate, Nazzy Albies. But what really stands out with Acuna is the speed and the athleticism overall, because he stole 42 bags on 47 attempts with the Rangers in their AA affiliate this year. With Binghamton, he's stolen seven on eight attempts. So he's up to 49 on the season. That's a type of stolen base threat the Mets have not had since Jose Reyes. And if Acuna can make it up, I mean, he could do what his brother's doing in the stolen base department and be pushing for 60 stolen bases in a given season. It's really impressive stuff. The question is going to be how much does he get on base? And at 20 years old, last year in high A, he put up a 900 OPS. Now he goes to AA again last year, put up a 650 OPS. So he struggled, but he kept the strikeouts down and the walks were still over 10%. That's the thing that I like about Acuna is the play discipline seems to be pretty good and the hit tool seems to be good enough. He hit 315 in AA this year, 377 on base, 453 slug. I don't know how much power he's going to tap into. You see people say maybe he tops out at 20 home runs, but that's not even necessarily a likely outcome. That's kind of the ceiling of his power. Maybe it's more a 10 to 15 home run guy with all of that speed on the bases. But what puts him over our number two prospect, which is Drew Gilbert, is the fact that that speed is something that is going to translate. And I think it's more clear at this point that Acuna is going to be an above average big leaguer. Gilbert, there's a really good chance of that as well, but Acuna has more time in AA. He spent the entire year there and he was there last year. He's a little bit further along. And I think what you know about Acuna already is the speed is going to translate and the defense is going to translate. They're projecting him out to be an above average defensive shortstop at second base next to Lindor. He could be elite. And I really think that is maybe the ultimate goal here. If you can sort of look at the 2024 Mets, you can envision a world where Jeff McNeil is your starting left fielder. You hope that Starley Marteg can figure things out and stick out and write. You have Nimmo in center and whenever Acuna is ready, he slides into second base. That could make a ton of sense for the Mets and that could be the long term answer. If Acuna is playing second, McNeil is playing left. You got incredible athleticism up the middle with Lindor and Acuna. And then you have Nimmo in center and who knows, maybe even get to a world where Starley Marteg falls out of the mix. Jeff McNeil slides to right, Brandon Nimmo slides to left and that opens the door for Drew Gilbert to be your starting center fielder. And that's not to say you give up or Nimmo has to give up a starting center field job to Drew Gilbert at the end of next season or even in 2025. Nimmo is getting paid to play center field and he's done a damn good job of it. Brandon Nimmo as a prospect was never considered a great defensive center fielder. It took incredible repetition, a ton of work ethic and really grinding at the MLB level to improve himself to get to that point where he had a season where he graded out as an elite defensive center fielder before he got his contract. And this year, while he's been good in the eye test says he's been a good center fielder, the metrics have again slid back down a little bit. Now as he's nursing a quad injury, we've seen him out in left field. So it's just interesting how all this starts to come together as a puzzle in your mind. And when you see Nimmo playing some games in left field, even though it's only because of a quad injury, you do remember, okay, that is something the Mets could go to at some point and Gilbert is a guy who probably brings his most value to the Mets in the future in center field. He's the top prospect they got back in the Justin Verlander trade. And in his first full season this year, he's already thriving in double A, but it didn't start that way. He began at high A, hit 361, 421 on base, 686 slug in 21 games. He was then called up to double A and he struggled. 561 OPS in June, but he came out of it strong, posted an 816 OPS in July, gets traded and in Binghamton with the Mets double A affiliate, 12 games is in 326, 373 on base, 478 slug, 851 OPS. It's interesting to talk about Nimmo and Gilbert because I almost feel like the best outcome for Gilbert is being the guy that Nimmo was last year and what he's done this year to a certain extent, but it's being a guy that can be an 800 OPS hitter who can steal the occasional bag, but that's one thing it hasn't really translated. He does have speed, but it hasn't translated to the base pass yet. So you're more looking at someone who you hope hits for a high average, does a great job with the play discipline, getting on base, and then you wonder how much power he taps into, but he's going to be a great center fielder. He's going to play really hard. Everyone loves his motor, the energy he brings. Seems like every single person who talks about this guy comes away with the exact same expression playing with his hair on fire and he's going to be a lot of fun to watch when he eventually makes it up. I think if he can tap into more power, I mean, there's a chance that he is a better player than Acuna. If he can actually get to that 20 home run pop, we'll see what that becomes. I think the thing about it too, the Nimmo comp, again, it's not necessarily saying their games are the same, but just what Nimmo has been able to accomplish at the big leagues is what you hope Gilbert can get to as far as now, Nimmo's about to have a 20 home run season at the big league level. Took a long time to get there. We'll see if Gilbert needs that much time to develop that quickly, but he's a really good prospect. I think what the Mets got with Gilbert and Acuna is they got a couple of big leaguers that should be on the roster by 2025 and hopefully big league starters. To pull that from a couple of guys that are pitching in their 40s basically, I mean, with Verlender, yes, and Scherz are soon to be at 40. That was a great reset on this franchise, which is what we've talked about a lot. What excites you about the farm system beyond that is when you look at three and four on my list here, it's two guys who are in high A, who I believe have higher ceilings than Acuna and Gilbert, guys that really could be needle movers if they develop and so far so good on that front. We'll talk about them next. Before we do today's episode is brought to you by sleeper. Want the chance to win more money with less picks? Head to sleeper where you can win up to a hundred times your money on just two or more fancy baseball picks. Sleepers now offering up to a hundred time payout for up to eight pick contests where you could choose as many as eight players that you like pick more or less on your favorite baseball stats, home run, strike, gas hits and more. Get your picks right and you could win big. You could also play with friends. There's a built in group chat functionality where you can see and copy your group's picks with the tap of a button. Actors can be made in 30 seconds or less. It's that easy. They're safe and fast withdrawals. Use promo code locked on. They'll get up to a hundred dollar match on your first deposit terms of conditions apply. See sleepers terms of use for details currently operational in over 30 States. Check out sleeper today. Hi, I'm Jeff Carr from lockdown Reds. You know, at the end of the first year, discover credit cards automatically double all the cash back that you've earned. That's right. Everything that you've earned doubled all the cash back from eating at your favorite soup, dumpling restaurant, doubled all the cash back from that trip that you sort of learned how to snowboard also doubled. And the best part you don't have to do anything ridiculous to get it. Nope. Discover does it automatically. Seriously though, see terms and check it out for yourself at discover.com slash match. So New York mats for the St. Louis Cardinals, 8 15 Eastern times tonight. Catch every picture of the Mets hometown broadcast with Sirius XM on the SXM app. Just search Mets. When it comes to the number three and number four prospects on my top 10 list, I was so torn. I really was. I agonized over it because I think the Mets have two guys in high a right now that have really high ceilings and that's jet Williams and Ryan Clifford with Clifford. It's power, power, power. And in a farm system that lacks it, I really was tempted to go that way because here's Clifford who has hit 20 home runs this year at 20 years old. He just turned 20. Most of his home runs came at 19. That power is really enticing. And then there's jet Williams. And honestly, I have to acknowledge I've been ignoring jet Williams a little bit because I've been doing these trip around the affiliates the last couple of days where I've been looking at the box course and somehow my I just because maybe I'm so enamored by Clifford, I went straight to Clifford and just went past the guy that's been lead off and tearing the cover off the ball in high a right now. And that's Williams. He has been amazing since getting the call up. He has hit safely in 11 of 15 games. He's bad in 280 games, got a 448 on base and a 462 slug. But awesome. He's had six stolen bases and seven attempts and he's still 19. Jet Williams was a was he the first round pick or a second round pick? Was he the comp pick was what jet Williams and Kevin Perata last year, I believe he was the 14th overall pick last year. So he was a really high draft pick for the Mets that it seems like they have, you know, hit a home run on. And it's interesting because when they selected Williams, I think everyone said like, all right, here's the makeup player for Pete Kerr Armstrong. And we'll see if he can end up being as highly regarded as PCA is because I've seen PCA as high as in the top 10 on some top 100 lists. I mean, he has really broken out in that Cub system in a way that is just frustrating for Mets fans. But Williams, man, the plate discipline is what is really incredible to me. You know, the strikeout rate low was 22 percent. And for Clifford's credit in the comparison, his was at twenty two point three percent in low way. But in high a it's the walk percentage. You know, he's drawn like 14 walks and a little over 60 plate appearances, which is ridiculous. Got a walk percentage of twenty three percent in high. It was at nineteen point nine percent in low way. It's really impressive that he's been able to get on base that much and have no show a hit tool as well. I mean, he had two forty nine on low way, but now he's hit safely eleven of fifteen games. You know, if he hits 280 while getting on base with walks the way he does, man, this guy can steal so many bases and it's really interesting to try to think about what you could have one day with Acuna and Williams stealing bases for you. I mean, that is really playing into the way baseball is trending now with these new rules and incentivizing base dealers. And I don't know how long or like if they're going to keep all of these specific rules from this season. But it's clear they want to emphasize speed in the game. That's where Major League Baseball is going and Williams is a prospect that fits right into that. And by the way, you know, he still has a chance to hit for a little bit of pop too. And it's it's so early in his minor league career to know where he's going to end up, how he's going to perform. I mean, last year, Alex Ramirez held his own in high. And this year he struggled. Next year, Jet Williams will likely start again in high. But he could quickly get that bump to double. And he's just looking like a much better player than Alex Ramirez is at this point. Ramirez, a little spoiler for our final part of the list next week. He fell out of my top 10 when I was really looking at it today. So we'll see if things can change that quickly. If Jet Williams goes out next year and struggles, maybe that is different. But for now, I got him as my number three prospect in this system. And then that brings me to Clifford at four. And I already mentioned it's the power. The power is a differentiating factor. And that's why he might be my favorite prospect in the Mets system, even though I'm not ranking him number one. He's just the prospect I'm most excited by because there's not a lot of guys the Mets have in their system that you look to the future and say, oh, maybe 40 homerun power. Clifford is that guy. And I think what separates Williams from Clifford at this point for me is the defense and the plate discipline aspect because Clifford is striking out a lot right now, particularly since coming over to the Mets. I think his strikeout percentage is like 45% with the cyclones. But on the season and high A, he's got about 300 plate appearances. His strikeout rate's at 27.9%. So you got a strikeout profile that's a little concerning, although the power certainly offsets it. And then you have the position question about him. Where is he going to play? Is he a first baseman? Is he a corner outfielder? If he can be a corner outfielder, well, that really bodes well for him as far as future rankings in the Mets system and beyond in top 100s. If he can be a right fielder and he has a pretty good arm, I think that changes some things. If he can be a first baseman who's still obviously a great slugging first baseman but strikes out a lot, doesn't have a defensive position beyond that, that's going to limit where he eventually will fall in as far as top prospects are concerned. So that's why I put Clifford for and Williams three. There's one more prospect though to close out our top five. We'll get to that in the next segment. I also do want to discuss a Mets victory because guess what? For the last time they faced them, they beat Adam Wainwright, but they didn't do it convincingly enough for my taste. We'll discuss the game and the top or the fifth best prospect in just a minute. First though, another word from our sponsors. This is David Harrison of the Locked On Commander's podcast to draw your attention to the taste that's going down in the bread aisle. All thanks to Dave's Killer Bread, bread amplified. Anyone can bake bread, few can rock it. And Dave's Killer Bread is the champion of killer taste, killer texture, and is for those who want to rise above the boring. Organic and healthy doesn't have to mean boring when it's made with the highest quality organic and non-GMO ingredients packed with whole grains, fiber and protein. 21 whole grains and seeds bread has a subtle sweetness and a seed coated crust while good seed products are the boldest and sweetest of all. Dave's Killer Bread was built on the belief that second chances can change lives because after spending 15 years in prison, not only did the guy with the guitar you see on every loaf turn his own life around, he's helping others to do the same by hiring the best people for the job. Regardless of their background, he's ensuring your mornings no longer tastes like cardboard. Your taste buds don't have to feel sedated and your sandwiches can become superstars. Visit Dave's killer bread dot com to learn more and look for Dave's Killer Bread in the bread aisle of your favorite grocery store. NFL Sunday Ticket is now on YouTube and YouTube TV, which means that it just got easier to be an NFL fan, even if you live far away. Like maybe you like the Bears, but you're hibernating in Panthers territory. But with NFL Sunday Ticket, your out of market team is never more than a short distance away, specifically the distance from you to your remote control. NFL Sunday Ticket, now on YouTube and YouTube TV. Go to youtube.com slash presale to get $50 off. Terms and embargoes apply. All friends, 919. No refunds. The New York Mets play the St. Louis Cardinals 8 15 Eastern time tonight. Get your pitch from that hometown broadcast with serious exam. The SXM map. Just search Mets. All right. Number five in the Mets system. Who's it going to be? Maybe not the sexiest of names because he's very familiar to fans. He's been around for a while. There's some prospect fatigue here, but I could not drop Ronnie Mauricio any further below than five. You know, there's things that you look at with Ryan Marissa that you don't like on this season. We look at WRC plus, which is a league adjusted stat. So if offense is through the roof in the league, which it is in AAA, that's going to change how you look at WRC plus that number of league average for the offensive output that these guys are putting in. You know, it raises to a certain bar, but in that offensive heavy league, he's been league average this year. He's been exactly at 101st WRC plus. So a league average hitter. Now with that said, it was his first go around in AAA this year. He is hitting 287. He's slugging 488. He's a home run away from a 20 home run, 20 stolen base season, and he's a shortstop prospect still. And I think the biggest thing that led me to put him above some of the other prospects that maybe were more excited about his fans is the fact that none of them are a high probability big league or Ronnie Mauricio is he's going to be a big league. Now is he a starting shortstop for a different team? Is he the starting right fielder, left fielder, third baseman or second baseman for the Mets? Is he a utility player? Is he a power bat off the bench? The role is yet to be defined and we'll see how he ultimately translates and the strike outs when he gets to the big leagues are going to be a question. This year he got under 20%. That's been really good to see, but he's not walking that much, only 6.1% of the time. So he still has some poor swing decisions and it's now the second year in a row where there's been some sort of rumblings about him getting bored with the league season, a little bit bored by being stuck in AA all year last year. Wanted to get the promotion up to triple, didn't happen. This year, I'm sure he's felt a million times over. He should have been called up and wasn't, now maybe he's got a little bit bored being in AAA. I don't know how he's going to translate when he gets to the big leagues. I do not know, but he think he will get there and he has enough tools that there's still a chance that he can be a guy that's an above average big leaguer and maybe a starter. I just don't know where he fits in with the Mets. And that's been my three year, I think, agonizing dispute in my mind over Ronnie Mauricio because we've talked about this on this show for the long time listeners forever. What's he going to be? Where is he going to play? Is he just someone that gets traded? And at one point was way more down on Ronnie Mauricio than I am now. And then he was the prospect I saw last year in person that I fell in love with. And then you still look at all the swing decisions and the stats and say, okay, well, what's he going to be? I just don't know. I don't know. And I think the thing that kind of makes me down him a little bit more is Brett Beatty has gone back to AAA and now you're seeing him head to head again, seeing them in the not head to head, but they're in the lineup together and you compare them again. And Brett Beatty still looks like the better player. He struggled in the big leagues this year, but I still would bet on Beatty having a better future at the Mets than Ronnie Mauricio. And I would bet on Beatty being the third baseman moving forward over Mauricio still. But could Ronnie Mauricio be a guy that works on some other positions in the off season and comes back to camp and is looking comfortable in a corner outfield spot and comfortable at second base and comfortable at third. And he's just this Swiss army knife on the Mets that is playing that Jeff McNeil type of role, maybe a little more on the bench, but a switch hitter that can bring pop and some speed. I mean, he could still be a really big piece of the Mets over the next couple of years. So he had to be included among the top five prospects in this system in my eyes. Again I told you what next week I'll break down the bottom five on my list. And who knows since I have time to look it over, maybe I'll change a little bit what I have right now. But it was pretty tough narrowing the last couple guys and leaving a few off. And as I mentioned already, Alex Ramirez was already a tough cut for me because you still hope that the promise we saw last year translates for now though with what we saw this season there's other prospects that are better. And again, we will go over all of them on our next Friday farm report. But let's talk about the big league club winning their second game in a row and having a good last licks on Adam Wainwright. Although the overall line for Wainwright has probably been one of his best starts of the season. Six innings pitch. So he got through six, which has not been happening. Only gave up four hits, walk three, struck out two, gave up three, earned. You know, Pino Lanza with the two run homer was the big blow. And then the Mets get another run on an RBI double from Francisco Lindor. And then later in the game, Tim LaCastro hits a home run to give the Mets an insurance run in that ninth inning. The bullpen in this game was good. Drew Smith, excuse me with the little voice crack there, Drew Smith, Grant Hartwig, Trevor Gott each pitching a scoreless inning. But the real story of this game to me is Jose Quintana. I feel so much better about the Mets rotation this year with each start from Quintana, the way he attacks, the fact that it's not even just this incredible stuff. It's just a crafty pitcher that knows what he has and can work his way deep into games too. I mean, six innings tonight, only get three hits, walked four, struck out five, ERA on the season 3.03. Shockingly, this is my own about shock. He's been pitching on the bad Mets. He has the whole years with the bad Mets, but he's really been pitching on the worst version of the Mets. But this was his first win. He's won in four, which is crazy to me until you remember again how bad the Mets have been because he's just pitched so much better than that. But I don't like Jose Quintana as the Mets number two, which is where he's at right now. But knowing that this is a front office and an owner that as much as you can listen to what Max Scherzer thought the plan was for next year, they're not going to sit idly by and do nothing this off season. I imagine they're going to add a couple of pitchers and whether Jose Quintana is your three or your four, I think the Mets rotations in a pretty good place. As long as they get a guy to pair with Kodai Sanga top the rotation and another guy that's in Quintana's tier, I feel pretty decent about what the Mets will look like next season. And that's just a matter of figuring out who that fifth starter is with some of the top prospects will be mentioned next week in the top 10 with whatever is going on with David Peterson and Tyler McGill. And if the Mets are able to even add another depth starter to that mix, but Jose Quintana and Kodai Sanga are looking like two pretty stable starters to begin to build the rotation around as you head into 2024. The rest of the weekend, three more games against the Cardinals. You will see Sanga pitch on Saturday night, so if you're going to tune into one game, that would be the one I recommend. They still haven't even announced the starter for Friday. And then Sunday, it's Carlos Carrasco. Anyway, that's going to be all for today's edition of Locked on Mets. As always, thank you for listening. Make sure you follow, rate, and review wherever your podcast. Follow me on Twitter, Ficklestein Ryan. Follow the show at Locked on Mets. If you want to catch every pitch in that's hometown broadcast, you can do so, SiriusXM on the SXM app. And search Mets."}, "podcast_summary": "In this episode of the Locked on Mets podcast, host Ryan Finkelstein discusses the top five prospects in the New York Mets farm system. He starts off by mentioning the recent emphasis the Mets have placed on building up their farm system since Steve Cohen took over as owner. Finkelstein then goes on to analyze the top prospects in the Mets system, as ranked by various outlets, including MLB Pipeline, Baseball America, Just Baseball, and ESPN. He discusses the strengths and weaknesses of each prospect and their potential impact on the team. The top five prospects mentioned are Luis Angel Acuña, Drew Gilbert, Jet Williams, Ryan Clifford, and Ronnie Mauricio. Finkelstein also discusses the recent Mets victory over the St. Louis Cardinals, with a focus on starting pitcher Jose Quintana's strong performance. He concludes the episode by previewing the upcoming games against the Cardinals and expressing confidence in the Mets rotation moving forward.", "podcast_guest": {"name": "Not Available", "org": "Not Available", "title": "Not Available", "summary": "Not Available"}}